# -*- coding: cp1253 -*-
#Διαβάζει από το πληκτρολόγιο (input) το ονομα ενός μαθητή
#και τους βαθμους Α', Β τετραμήνου και των γραπτών εξετάσεων
#ενός μαθήματος και αφού υπολογίσει τον τελικό μέσο όρο του μαθήματος
#τον εμφανίζει στην οθόνη (print).
#Η εισαγωγή των δεδομένων αλλά και η εμφάνιση του τελικού μέσου όρου γίνεται
#με τα κατάλληλα μηνήματα π.χ. 'Δώσε το όνομα του/της μαθητή/-ριας:'
#Σημείωση: υπολογίστε αρχικά το μέσο όρο των τετραμήνων και στη συνέχεια το
#μέσο όρο του ΜέσουΌρου των τετραμήνων και των γραπτών εξετάσεων

#εισαγωγή δεδομένων
name=input('Δώσε το όνομα του/της μαθητή/-ριας:')
vathA=int(input('Βαθμός Α'' τετραμήνου:'))
vathB=int(input('Βαθμός Β'' τετραμήνου:'))
# Ο βαθμός των γραπτών ενδέχεται να είναι δεκαδικός! άρα δε χρησιμοποιώ τη δήλωση int
grapta=(input('Βαθμός Γραπτών Εξετάσεων:'))

#υπολογισμοί ζητουμένων - επεξεργασία δεδομένων
mesostetr = (vathA + vathB)/2
mesosoros = (mesostetr + grapta)/2

# εμφάνιση αποτελεσμάτων
print 'Ο τελικός μέσος όρος του/της:', name,'είναι', mesosoros
