# -*- coding: cp1253 -*-

# 'Το πρόγραμμα διαβάζει (input) όνομα μαθητή/τριας και'
# 'το βαθμό Α τετραμήνου, Β τετραμήνου και γραπτών εξετάσεων'
# 'και αφού υπολογίζει τον τελικό βαθμό του μαθήματος'
# 'τον εμφανίζει με κατάλληλο μήνυμα (print)'
# 'Ο τελικός βαθμός προκεύπτει ως εξής:'
# 'ΜΟτετρ=(βαθμός Α + βαθμός Β)/2'
# 'και ΜΟ=ΜΟτετρ+βαθΓραπτων) / 2'

print 'ΥΠΟΛΟΓΙΣΜΟΣ ΤΕΛΙΚΗΣ ΒΑΘΜΟΛΟΓΙΑΣ ΜΑΘΗΤΗ'
print ''
print 'Το πρόγραμμα αυτό υπλογίζει τον τελικό βαθμό μαθητή.'
print 'Στην αρχή εισάγετε το όνομα του μαθητή, της μαθήτριας. Μην ξεχάσετε να πληκτρολογήσετε μεταξύ σημείων \'ΟΝΟΜΑ\' '
print 'Στην συνέχεια εισάγετε τον βαθμό για το Α τετράμηνο.'
print 'Ακολουθεί η εισαγωγή του βαθμού του Β τετραμήνου'
print 'Τέλος εισάγετε τον βαθμό των γραπτών.'
print 'Το πρόγραμμα υπολογίζει τον μέσο όρο των βαθμών του πρώτου και δευτέρου τετραμήνου.'
print 'Στη συνέχεια στον μέσο όρο των τετραμήνων προστίθεται και ο βαθμός των γραπτών και βρίσκουμε μέσο όρο.'
print 'Τέλος εμφανίζουμε το αποτέλεσμα.'
print ''

# Εισαγωγή δεδομένων
name=input('Εισάγετε ονοματεπώνυμο μαθητή (ανάμεσα σε "):') # Εισαγωγή ονόματος μαθητή
batha=int(input('Εισάγετε βαθμό Α\' τετραμήνου (ακέραιος):')) # Εισαγωγή βαθμολογίας πρώτου τετραμήνου
bathb=int(input('Εισάγετε βαθμό Β\' τετραμήνου (ακέραιος):')) # Εισαγωγή βαθμολογίας δευτέρου τετραμήνου
grapta=input('Εισάγετε βαθμό τελικών γραπτών εξετάσεων (δεκαδικός):') # Εισαγωγή βαθμολογίας γραπτών. Ο βαθμός των γραπτών ενδέχεται να είναι δεκαδικός! άρα δε χρησιμοποιώ τη δήλωση int

# Υπολογισμός δεδομένων
motetr=(batha+bathb)/2
mesosoros=(motetr+grapta)/2

# Εμφάνιση αποτελεσμάτων
print 'Ο τελικός βαθμός του/της μαθητή/τριας',name,'είναι',mesosoros
print ''
print ''
# Το παρακάτω είναι εκτός ζητούμενων άσκησης. Τα πρόσθεσα εγώ για να είναι πιο ελκυστικό.
if mo>=10 :
    print 'Μπράβο. Πέρασες την τάξη'
else :
    print 'Λυπάμαι. Κόπηκες. Πρέπει να παρακολουθήσεις ξανά την τάξη.'
print ''
print ''
print 'Εάν θέλετε ξαναεκτελέστε το πρόγραμμα για άλλες βαθμολογίες. Ευχαριστούμε για την προτίμησή σας.'
print ''
print 'Copyleft 2018, Efstathios Iosifidis'
