# -*- coding: cp1253 -*-
'''
Στα πλαίσια μιας προωθητικής ενέργειας μιας τράπεζας, ένας κάτοχος πιστωτικής
κάρτας κέρδισε, με τους πόντους που συγκέντρωσε, μια ηλεκτρονική δωροεπιταγή
αξίας 500 ευρώ την οποία πρέπει να ξοδέψει εξ ολοκλήρου σε μια επίσκεψη του
σε συγκεκριμένο ηλεκτρονικό κατάστημα. 
Να αναπτύξετε πρόγραμμα το οποίο:
    
Γ1. Θα διαβάζει την τιμή κάθε προϊόντος που επιθυμεί να αγοράσει ο καταναλωτής
καθώς και την επωνυμία (μάρκα) του προϊόντος. 
Σημειώνεται ότι κάθε φορά ο καταναλωτής μπορεί να προχωρήσει στην αγορά ενός
μόνο τεμαχίου. Ο αλγόριθμος θα επιτρέπει στον καταναλωτή να προβεί στην αγορά
αν και μόνο αν διαθέτει στην ηλεκτρονική δωροεπιταγή επαρκές υπόλοιπο. Αλλιώς
θα ρωτάει τον καταναλωτή αν θέλει να συνεχίσει με επόμενη αγορά τυπώνοντας το
διαθέσιμο υπόλοιπο. Αν το διαθέσιμο υπόλοιπο γίνει μηδέν θα τερματίζει από
μόνος του τυπώνοντας μήνυμα «Τέλος Αγορών». 

Γ2. Το πρόγραμμα πρέπει να τυπώνει το συνολικό ποσό της δωροεπιταγής που
ξοδεύτηκε καθώς και τον αριθμό των τεμαχίων που αγοράστηκαν με αυτό το
ποσό. 
Γ3. Στην περίπτωση που, κατά την διάρκεια των αγορών,
τα τεμάχια της μάρκας Nike που αγοράστηκαν υπερβαίνουν τα 5, τότε, λόγω
επιπλέον προωθητικών ενεργειών του ηλεκτρονικού καταστήματος, πιστώνεται
στην ηλεκτρονική δωροεπιταγή του καταναλωτή το επιπλέον ποσό των 20
ευρώ. Αν δε, τα τεμάχια της μάρκας Nike που αγοράστηκαν υπερβαίνουν τα
10, τότε στην ηλεκτρονική δωροεπιταγή πιστώνεται το επιπλέον ποσό των 30
ευρώ. Ο αλγόριθμος θα πρέπει να εμφανίζει στην έξοδο αν ο καταναλωτής
επωφελήθηκε από την προσφορά της μάρκας Nike ή όχι.

Σημείωση: Η πίστωση του επιπλέον ποσού θα γίνει μια φορά, σε κάθε μια από
τις 2 περιπτώσεις και όχι για κάθε προϊόν πάνω από τα ελάχιστα απαιτούμενα.
'''
