# -*- coding: cp1253 -*-
'''
Δίνεται το παρακάτω τμήμα προγράμματος Python:
for x in range (A, M, B):
    print x 
 
Για καθεμιά από τις παρακάτω περιπτώσεις, να γράψετε στο
τετράδιό σας τις τιμές των A, M, B, έτσι ώστε το αντίστοιχο
τμήμα προγράμματος να εμφανίζει όλους :
α.  τους ακέραιους από 1 μέχρι και 80 (αύξουσα σειρά)
β.  τους ακέραιους από 50 μέχρι και 20 (φθίνουσα σειρά)  
γ.  τους περιττούς ακέραιους από 81 μέχρι και 151 (αύξουσα
σειρά) 
δ.  τους ακέραιους από -50 μέχρι και -5 (αύξουσα σειρά) 
ε.  τους θετικούς ακέραιους που είναι μικρότεροι του 200 και
πολλαπλάσιοι του 7 (αύξουσα σειρά). 
'''

print 'α\n'
for x in range (1, 81, 1):
    print x 

print 'β\n'
for x in range (50, 19, -1):
    print x 

print 'γ\n'
for x in range (81, 152, 2):
    print x 

print 'δ\n'
for x in range (-50, -4, 1):
    print x 

print 'ε\n'
for x in range (0, 200, 7):
    print x 
