# -*- coding: utf-8 -*-
'''
Ένα φορτηγό εταιρίας μπορεί να μεταφέρει βάρος μέχρι 1.500 
κιλά. Η εταιρία το γεμίζει με κιβώτια διαφορετικού βάρους το 
καθένα. Θεωρούμε ότι το φορτηγό είναι αρχικά άδειο. 
  Το παρακάτω τμήμα προγράμματος σε γλώσσα Python διαβάζει 
το βάρος κάθε κιβωτίου σε κιλά μέχρι το συνολικό βάρος των
κιβωτίων να μην ξεπεράσει τη δυνατότητα μεταφοράς του
φορτηγού. Στη συνέχεια εμφανίζει το πλήθος των κιβωτίων που
έχουν τοποθετηθεί στο φορτηγό.  
Στο πρόγραμμα υπάρχουν πέντε κενά, τα οποία έχουν
αριθμηθεί και υπογραμμιστεί. Να γράψετε στο τετράδιό σας 
τον αριθμό του κενού και δίπλα τι πρέπει να συμπληρωθεί ώστε
το πρόγραμμα να εκτελεί σωστά τη λειτουργία του.
'''
size = input("∆ώστε βάρος κιβωτίου σε κιλά=")
kivotia = 0       
capacity = 1500.0
while  (1) <= (2) :
    capacity =  (3) - (4)   
    kivotia = kivotia + 1
    size = input("∆ώστε βάρος κιβωτίου σε κιλά=")
print 'Πλήθος κιβωτίων=', (5)
 
'''
ΛΥΣΗ
(1) size
(2) capacity
(3) capacity
(4) size
(5) kivotia
'''
