# -*- coding: utf-8 -*-

#Γράψτε ένα πρόγραμμα Python το οποίο υπολογίζει τον μεγαλύτερο περιττό αριθμό μεταξύ των
#ακεραίων x, y και z.

#Εισαγωγή αριθμών
x = int(input('Δώστε αριθμό x: '))
y = int(input('Δώστε αριθμό y: '))
z = int(input('Δώστε αριθμό z: '))

#Έλεγχος δεδομένων
if (x>y and x>z):
    print 'Ο μέγιστος είναι ο x:',x
elif (y>x and y>z):
    print 'Ο μέγιστος είναι ο y:',y
else:
    print 'Ο μέγιστος είναι ο z:',z


print ''
print ''
print 'Εάν θέλετε ξαναεκτελέστε το πρόγραμμα για άλλα 3 νούμερα.'
print 'Ευχαριστούμε για την προτίμησή σας.'
print ''
print 'Copyleft 2018, Efstathios Iosifidis'
