# -*- coding: cp1253 -*-

#Γράψτε μερικές εντολές Python οι οποίες δεδομένης μιας θερμοκρασίας T τυπώνουν το μήνυμα
#Cold... αν η θερμοκρασία είναι μικρότερη από 10 βαθμούς, το μήνημα Hot... αν η θερμοκρασία είναι
#μεγαλύτερη από 35 βαθμούς και το μήνυμα Pleasant... διαφορετικά.

# Διαβάζει Θερμοκρασία
thermokrasia=float(input('Δώστε θερμοκρασία που υπάρχει τώρα:'))

# Εμφανιση αποτελεσματων
if thermokrasia<10.0:
    print 'Cold'
elif thermokrasia>35.0:
    print 'Hot'
else:
    print 'Plesant'

print ''
print ''
print 'Εάν θέλετε ξαναεκτελέστε το πρόγραμμα για άλλες θερμοκρασίες.'
print 'Ευχαριστούμε για την προτίμησή σας.'
print ''
print 'Copyleft 2018, Efstathios Iosifidis'

