# -*- coding: utf-8 -*-

# Αρχικοποίηση
sum=0 # Αθροιστής
stoixeia=0 # Μετρητής
plithos=0 # Μετρητής
arithmoi=[] # Δημιουργία Λίστας

#Ερώτημα α
for i in range(500): # Κάνε 500 επαναλήψεις
    arithmos=int(input("Δώσε αριθμό:")) # Διαβάζει αριθμό
    print ""
    arithmoi.append(arithmos) # Προσθέτει τον αριθμό στην λίστα
# Ερώτημα β
for i in range(500): # Κάνε 500 επαναλήψεις
    if arithmoi[i]<11: # Εάν ο αριθμός είναι μικρότερος του 11
        plithos=plithos+1 # Πρόσθεσε ένα
print "Το πλήθος των αριθμών που είναι μικρότεροι του 11 είναι:",plithos

# Ερώτημα γ
for i in range(500): # Κάνε 500 επαναλήψεις
    sum=sum+arithmoi[i] # Πρόσθεσε όλα τα στοιχεία της λίστας
mo=sum/500.0 # Διαίρεσε το άθροισμα με το πλήθος των αριθμών (500). Το βάζουμε ως 500.0 για να βγάλει δεκαδικό η διαίρεση
misomo=mo/2.0 # Το μισό του μέσου όρου. Και εδώ πάλι το βάζουμε 2.0 για να βγει δεκαδικό
for i in range(500): # Κάνε 500 επαναλλήψεις
    if arithmoi[i]<misomo: # Έλεγχος κάθε στοιχείου εάν είναι μικρότερο του μισού του μέσου όρου
        stoixeia=stoixeia+1 # Πρόσθεσε ένα
print "Το πλήθος των αριθμών που είναι μικρότεροι του μισού του μέσου όρου είναι:",stoixeia

# Footer
print ''
print 'Πω πω μια στροφάρα!!! Έλα γιώργη...'
print 'Ευχαριστούμε για την προτίμησή σας.'
print 'E-mail: iefstathios@gmail.com'
print 'Copyleft 2019, Efstathios Iosifidis'
