# -*- coding: utf-8 -*-

# Αρχικοποίηση
ONOMA=[] # Δημιουργώ λίστα
ETH_YPHR=[] # Δημιουργώ λίστα
MIS8OS=[] # Δημιουργώ λίστα
sum=0.0 # Αθροιστής

# Εισαγωγή δεδομένων
for i in range(2): # Κάνε 2300 επαναλήψεις
    name=raw_input("Δώσε όνομα υπαλλήλου:") # Εισαγωγή ονόματος
    ONOMA.append(name) # Πρόσθεσε το όνομα στην λίστα
    print ""
    eti=float(input("Δώσε έτη εργασίας:")) # Εισαγωγή έτους
    ETH_YPHR.append(eti) # Προσθήκη έτους στην λίστα
    print ""
    misthos=float(input("Δώσε μισθό:")) # Εισαγωγή μισθού
    MIS8OS.append(misthos) # Προσθήκη μισθού στην λίστα
    print ""

# Αρχικοποίηση ερωτήματος β
max=MIS8OS[0] # Θέτω το μέγιστω ως 0
min=MIS8OS[0] # Το ελάχιστο ίσο με τον τελευταίο μισθό που εισήχθη
maxname=ONOMA[0] # Το όνομα του εργαζομένου με τον μέγιστο μισθό είναι ίσο με το τελευταίο όνομα που εισήχθη
minname=ONOMA[0] # Το όνομα του εργαζομένου με τον ελάχιστο μισθό είναι ίσο με το τελευταίο όνομα που εισήχθη
    
# Ερώτημα α
for i in range(2300): # Κάνε 2300 επαναλήψεις
    if ETH_YPHR[i]>=6 and ETH_YPHR[i]<=11: # Εάν τα έτη υπηρεσίας βρίσκονται μεταξύ 6 και 11
	sum=sum+MIS8OS[i]*0.06 # Άθροιρσμα μείωσης μισθού
        MIS8OS[i]=MIS8OS[i]-MIS8OS[i]*0.06 # Υπολόγισε τον νέο μισθό
    elif ETH_YPHR[i]>=12 and ETH_YPHR[i]<=18: # Εάν τα έτη είναι μεταξύ 12 και 18
	sum=sum+MIS8OS[i]*0.12 # Άθροιρσμα μείωσης μισθού
        MIS8OS[i]=MIS8OS[i]-MIS8OS[i]*0.12 # Υπολόγισε τον νέο μισθό
    elif ETH_YPHR[i]>18: # Εάν τα έτη είναι πάνω από 18
	sum=sum+MIS8OS[i]*0.17 # Άθροιρσμα μείωσης μισθού
        MIS8OS[i]=MIS8OS[i]-MIS8OS[i]*0.17 # Υπολόγισε τον νέο μισθό


# Ερώτημα β

for i in range(2300): # Κάνε 2300 επαναλήψεις
    if MIS8OS[i]>max: # Εάν ο μισθός είναι μεγαλύτερος από τον max
        max=MIS8OS[i] # Το νέο max είναι ίσο με τον μισθό
        maxname=ONOMA[i] # Και κρατάμε το όνομα του υπαλλήλου με τον μεγαλύτερο μισθό
    if MIS8OS[i]<min: # Εάν ο μισθός είναι μικρότερος από τον min
        min=MIS8OS[i] # Τότε νέο min θα είναι ίσο με τον μισθό
        minname=ONOMA[i] # Και κρατάμε το όνομα του υπαλλήλου με τον μικρότερο μισθό

print "Ο υπάλληλος",maxname,"έχει τον υψηλότερο μισθό μετά την μείωση. Λαμβάνει",max,"Ευρώ"
print ""
print "Ο υπάλληλος",minname,"έχει τον χαμηλότερο μισθό μετά την μείωση. Λαμβάνει",min,"Ευρώ"
print ""

# Ερώτημα γ
mesimiosi=sum/2300 # Υπολογισμός της μέσης μείωσης (το sum είναι float γιατί μετράμε μισθό που δηλώθηκε ως float)
print "Η μέση μείωση μισθού είναι:",mesimiosi,"Ευρώ"
print ""

# Ερώτημα δ
print "Τα κέρδη της εταιρίας ήταν:",sum
print ""

# Ερώτημα α (εμφάνιση)
print "Οι μισθοί μετά τη μείωση θα είναι:"
print ""
for i in range(2300):
	print MIS8OS[i] # θα εκτυπώσει τους μισθούς σε στήλη

# Footer
print ''
print 'Πω πω μια στροφάρα!!! Έλα γιώργη...'
print 'Ευχαριστούμε για την προτίμησή σας.'
print 'E-mail: iefstathios@gmail.com'
print 'Copyleft 2019, Efstathios Iosifidis'
