# -*- coding: utf-8 -*-

# Αρχικοποίηση
sum=0 # Αθροιστης
min=vathmos # Ελάχιστο
max=vathmos # Μέγιστο
mathites=0 # Μετρητής
perasan=0 # Μετρητής πόσοι πέρασαν (ερώτημα c)
next="Ν" # Σημαία για να μπει στην επανάληψη

# Εισαγωγή δεδομένων


#Έλεγχος δεδομένων
while next=="N": # Όσο θα εισάγει το Ν, να εκτελούνται οι παρακάτω εντολές
    vathmos=float(input("Δώσε βαθμό μαθητή στην Άλγεβρα (0-20): ")) # Ερώτημα εισαγωγής βαθμού
    while vathmos<0 or vathmos>20: # Έλεγχος εγυρότητας
       vathmos=float(input("Δώσε σωστό βαθμό μαθητή στην Άλγεβρα (0-20): ")) # Ερώτημα εισαγωγής σωστού βαθμού     
    print "" # Το βάζω για να έχει οπτικά μια σειρά κενό.
    if vathmos>max: # Αν ο βαθμός είναι μεγαλύτερος του μέγιστου (ερώτημα a)
        max=vathmos # Τότε το μέγιστο είναι ίσο με τον βαθμό (ερώτημα a)
    if vathmos<min: # Αν ο βαθμός είναι μικρότερος του ελάχιστου (ερώτημα a)
        min=vathmos # Τότε το ελάχιστο είναι ίσο με τον βαθμό (ερώτημα a)
    sum=sum+vathmos # Αθροιστής συνόλου βαθμών για να βρούμε τον μέση τιμή (ερώτημα b)
    mathites=mathites+1 # Μετρητής συνόλου μαθητών για να βρούμε τον μέση τιμή (ερώτημα b)
    if vathmos>=10: # Αν ο βαθμός είναι πάνω από 10 (προβιβάσιμος)
        perasan=perasan+1 # Τότε μέτρα αυτούς που πέρασαν (ερώτημα c)
    next=raw_imput("Θέλετε να κάνετε νέα καταχώρηση; (Ν/Ο)") # Ερώτημα για εισαγωγή νέου μαθητή. Με Ο, βγαίνει από επανάληψη
    print "" # Το βάζω για να έχει οπτικά μια σειρά κενό.

  

# Επεξεργασία-Αποτελέσματα
print "" # Το βάζω για να έχει οπτικά μια σειρά κενό.
print "Ο μέγαλύτερος βαθμός είναι:",max # Εμφάνιση μέγιστου (ερώτημα a)
print "" # Το βάζω για να έχει οπτικά μια σειρά κενό.
print "Ο μικρότερος βαθμός είναι:",min # Εμφάνιση ελάχιστου (ερώτημα a)
print "" # Το βάζω για να έχει οπτικά μια σειρά κενό.

if mathites!=0: # Εάν το άθροισμα των μαθητών είναι διαφορετικό του 0 (ερώτημα b)
    mo=sum/mathites # Υπολόγισε την μέση τιμή της βαθμολογίας (ερώτημα b)
    print "Η μέση τιμή της βαθμολογίας είναι:",mo # Εμφάνισε την μέση τιμή (ερώτημα b)
else:
    print "Δεν δώσατε τιμές"
print "" # Το βάζω για να έχει οπτικά μια σειρά κενό.

if mathites!=0: # Εάν το άθροισμα των μαθητών είναι διαφορετικό του 0 (ερώτημα c)
    pososto=perasan/float(mathites)*100 # Τότε το ποσοστό των μαθητών ιστούται (ερώτημα c)
    print "Το ποσοστό των μαθητών που πέρασαν επιτυχώς το μάθημα είναι:",pososto # Εμφάνισε ποσοστό (ερώτημα c)

# Ερώτημα με ποότητα (ποσοστιαία βελτίωση ή χειροτέρεψη)

pxiotita=mo-13.2/13.2*100 # Υπολογισμός ποσοστιαίας αύξησης ή μείωσης ποιότητας
if pxiotita>0: # Αν η ποιότητα είναι θετικός αριθμός
    print "Η ποιότητα βελτιώθηκε κατά",pxiotita,"%" # Εμφάνιση αποτελέσματος ότι αυξήθηκε κατά το ποσοστό
elif pxiotita<0: # Αν η ποιότητα είναι αρνητικός αριθμός
    print "Η ποιότητα μειώθηκε κατά",pxiotita*(-1),"%" # Τότε η ποιότητα μειώθηκε κατά το ποσοστό
elif pxiotita=0: # Εάν η ποιότητα ισούται με 0
    print "Η ποιότητα δεν μεταβλήθηκε" # Δεν μεταβλήθηκε η ποιότητα


# Footer
print ''
print 'Πω πω μια στροφάρα!!! Έλα γιώργη...'
print 'Ευχαριστούμε για την προτίμησή σας.'
print 'E-mail: iefstathios@gmail.com'
print 'Copyleft 2019, Efstathios Iosifidis'
