# -*- coding: utf-8 -*-

# Αρχικοποίηση-Αθροιστές-Μετρητές
days1=0 # Αθροιστής ημερών για το πρώτο διαμέρισμα
days2=0 # Αθροιστής ημερών για το δεύτερο διαμέρισμα

# Εισαγωγή-Έλεγχος δεδομένων
for pelates in range (20): # Ερώτημα Α (λέει για 20 πελάτες, οπότε πάμε με for επειδή έχω γνωστό αριθμό πελατών)
	room=int(input("Εισάγετε διαμέρισμα που θέλετε να μείνετε (1 ή 2): ")) # Ερώτημα Α
	days=int(input("Εισάγετε τις ημέρες που θα διαμείνετε:")) # Ερώτημα Α
	# Από εδώ αρχίζει ο υπολογισμός του ερωτήματος b
	if room==1: # Αν εισάγει διαμέρισμα με αριθμό 1
		days1=days1+days # Αθροιστής ημερών για πρώτο διαμέρισμα 
		if days<=5: # Αν οι μέρες είναι κάτω από 5
			poso=days*150 # Υπολόγισε το ποσό
			print "Ο πελάτης θα πληρώσει",poso # Εμφάνισε το ποσό
		elif days<=15: # Εάν οι ημέρες είναι έως 15
			poso=5*150+(days-5)*120 # Το ποσό για τις πρώτες 5 μέρες είναι γνωστό, υπολόγισε για πόσες μένουν και άθροισε
			print "Ο πελάτης θα πληρώσει",poso # Εμφάνισε το ποσό
		else: # Εάν οι μέρες είναι πάνω από 15 (σε κάθε άλλη περίπτωση)
			poso=5*150+10*120+(days-15)*100 # Το ποσό για τις 5 και για τις επόμενες 10 είναι γνωστό, οπότε υπολόγισε πόσες μένουν και άθροισε
			print "Ο πελάτης θα πληρώσει",poso # Εμφάνιση ποσού
	if room==2: # Αν εισάγει διαμέρισμα με αριθμό 2
		days2=days2+days # Αθροιστής ημερών για δεύτερο διαμέρισμα 
		if days<=5: # Αν οι μέρες είναι κάτω από 5
			poso=days*180 # Υπολόγισε το ποσό
			print "Ο πελάτης θα πληρώσει",poso # Εμφάνισε το ποσό
		elif days<=15: # Εάν οι ημέρες είναι έως 15
			poso=5*180+(days-5)*140 # Το ποσό για τις πρώτες 5 μέρες είναι γνωστό, υπολόγισε για πόσες μένουν και άθροισε
			print "Ο πελάτης θα πληρώσει",poso # Εμφάνισε το ποσό
		else: # Εάν οι μέρες είναι πάνω από 15 (σε κάθε άλλη περίπτωση)
			poso=5*180+10*140+(days-15)*110 # Το ποσό για τις 5 και για τις επόμενες 10 είναι γνωστό, οπότε υπολόγισε πόσες μένουν και άθροισε
			print "Ο πελάτης θα πληρώσει",poso # Εμφάνισε το ποσό

# Αποτελέσματα
print "" # Το βάζω για να έχει οπτικά μια σειρά κενό.
print "Το πρώτο διαμέρισμα νοικιάστηκε για",days1,"ημέρες" # ερώτημα c
print "" # Το βάζω για να έχει οπτικά μια σειρά κενό.
print "Το δεύτερο διαμέρισμα νοικιάστηκε για",days2,"ημέρες" # ερώτημα c
print "" # Το βάζω για να έχει οπτικά μια σειρά κενό.
print "Το σύνολο των ημερών που νοικιάστηκαν και τα δυο διαμερίσματα ήταν",days1+days2,"ημέρες" # ερώτημα d


# Footer
print ''
print 'Πω πω μια στροφάρα!!! Έλα γιώργη...'
print 'Ευχαριστούμε για την προτίμησή σας.'
print 'E-mail: iefstathios@gmail.com'
print 'Copyleft 2019, Efstathios Iosifidis'
