# -*- coding: utf-8 -*-

# Μια μπάλα αφήνεται να πέσει από ύψος 50 μέτρων. Σε κάθε αναπήδηση φτάνει σε ύψος ίσο με τα 4/5 του προηγούμενου. Να αναπτύξετε αλγόριθμο που θα υπολογίζει το πλήθος των αναπηδήσεων που απαιτούνται ώστε να ακινητοποιηθεί η μπάλα. (Θεωρούμε ότι η μπάλα είναι ακίνητη από τη στιγμή που βρίσκεται σε ύψος 0.5 εκατοστά ή λιγότερο.)

# Αρχικοποίηση
ypsos=50
anapidisi=0

# Έλεγχος-Επεξεργασία
while ypsos>0.5:
    ypsos=ypsos*4/5
    anapidisi=anapidisi+1


# Εμφάνιση
print ""
print "Μετά από",anapidisi,"ακινητοποιείται η μπάλα"



# Footer
print ''
print 'Πω πω μια στροφάρα!!! Έλα γιώργη...'
print 'Ευχαριστούμε για την προτίμησή σας.'
print 'E-mail: iefstathios@gmail.com'
print 'Copyleft 2019, Efstathios Iosifidis'
