# -*- coding: utf-8 -*-

# Ο ταμίας ενός supermarket καταχωρεί στην ταμειακή μηχανή, για κάθε προϊόν που αγοράζεται, τον κωδικό του προϊόντος και την τιμή. Όταν ολοκληρωθεί η καταχώρηση για την αγορά ενός πελάτη, τότε εισάγεται ο κωδικός 0. Να αναπτυχθεί πρόγραμμα που θα υλοποιεί την παραπάνω διαδικασία και στο τέλος θα εκτυπώνει το συνολικό ποσό της αγοράς και το πλήθος των προϊόντων που αγοράστηκαν.

# Αρχικοποίηση
poso=0 # Αθροιστής
proion=0 # Μετρητής

# Εισαγωγή δεδομένων
kodikos=int(input("Δώστε κωδικό ή 0 για τερματισμό:"))

# Έλεγχος-Επεξεργασία
while kodikos!=0:
    timi=float(input("Δώσε τιμή προϊόντος:"))
    print ''
    proion=proion+1
    poso=poso+timi
    kodikos=int(input("Δώστε κωδικό ή 0 για τερματισμό:"))
    print ''

# Εμφάνιση
if proion!=0:
   print 'Ο πελάτης αγόρασε',proion,'προϊόντα. Το κόστος αυτών είναι',poso,"Ευρώ"
else:
    print "Δεν εισάγατε προϊόντα."


# Footer
print ''
print 'Πω πω μια στροφάρα!!! Έλα γιώργη...'
print 'Ευχαριστούμε για την προτίμησή σας.'
print 'E-mail: iefstathios@gmail.com'
print 'Copyleft 2019, Efstathios Iosifidis'
