# -*- coding: utf-8 -*-

# Ένας μαθητής που τελείωσε το γυμνάσιο με άριστα ζήτησε από τους γονείς του να του αγοράσουν ένα υπολογιστικό σύστημα αξίας 1000€. Οι γονείς του δήλωσαν ότι μπορούν να του διαθέσουν σταδιακά το ποσό, δίνοντάς του κάθε εβδομάδα ποσό διπλάσιο από την προηγούμενη, αρχίζοντας την πρώτη εβδομάδα με 20€. Να αναπτύξετε πρόγραμμα που:
# α. θα υπολογίζει και θα εμφανίζει έπειτα από πόσες εβδομάδες θα μπορέσει να αγοράσει το υπολογιστικό σύστημα.
# β. θα υπολογίζει, θα ελέγχει και θα εμφανίζει πιθανό περίσσευμα χρημάτων.

# Αρχικοποίηση
week=1 # Μετρητής
poso=20 # Αθροιστής

# Εισαγωγή δεδομένων (εναλλακτικά για εισαγωγή ποσού αντί για 20 €)
# poso=float(input("Δώστε αρχικό ποσό:"))

# Έλεγχος-Επεξεργασία
while poso<=1000:
    poso=poso*2
    week=week+1

ipoloipo=poso-1000

# Εμφάνιση
print "Η αγορά θα γίνει μετά από",week,"εβδομάδες"
print ""
print "Πιθανό περισσευμα χρημάτων θα είναι",ipoloipo,"€"

# Footer
print ''
print 'Πω πω μια στροφάρα!!! Έλα γιώργη...'
print 'Ευχαριστούμε για την προτίμησή σας.'
print 'E-mail: iefstathios@gmail.com'
print 'Copyleft 2019, Efstathios Iosifidis'
