# -*- coding: utf-8 -*-

# Κάποιος καταθέτει 5500€ στην τράπεζα με ετήσιο επιτόκιο 4.9%. Να αναπτυχθεί πρόγραμμα το οποίο:
# α. Θα διαβάζει τα έτη που παραμένουν τα χρήματα στην τράπεζα και θα εκτυπώνει το ποσό που θα υπάρχει στον λογαριασμό της τράπεζας.
# β. Θα εκτυπώνει το χρονικό διάστημα που απαιτείται ώστε οι καταθέσεις να γίνουν 6000€.
# γ. Αν 3 έτη μετά την αρχική κατάθεση κατατεθούν και άλλα 2500€ στον λογαριασμό, πόσα χρήματα θα διαθέτει ο λογαριασμός με τη συμπλήρωση 8 ετών;

# Ερώτημα α
# Αρχικοποίηση
poso=5500

# Εισαγωγή δεδομένων
etos=int(input("Δώστε έτη παραμονής χρημάτων στην τράπεζα:"))
print ""

# Έλεγχος-Επεξεργασία
for i in range(etos):
    tokos=poso*0.049
    poso=poso+tokos

# Εμφάνιση
print "Το ποσό που θα υπάρχει στον λογαριασμό μετά τα",etos,"έτη θα είναι",poso,"Ευρώ"
print ""

# Ερώτημα β
# Αρχικοποίηση
poso=5500 # Για να μην ορίσω νέα μεταβλητή, αρχικοποιώ ξανά την μεταβλητή poso εδώ
eti=0

# Έλεγχος-Επεξεργασία
while poso<6000:
    eti=eti+1
    tokos=poso*0.049
    poso=poso+tokos

# Εμφάνιση
print "Το χρονικό διάστημα για να γίνουν 6000 είναι",eti,"έτη."
print ""

# Ερώτημα γ
# Αρχικοποίηση
poso=5500 # Για να μην ορίσω νέα μεταβλητή, αρχικοποιώ ξανά την μεταβλητή poso εδώ
poso1=2500

# Εισαγωγή δεδομένων

# Έλεγχος-Επεξεργασία
for i in range(3):
    tokos=poso*0.049
    poso=poso+tokos

poso=poso+poso1 # Προσθήκη στο τέλος των 3 ετών άλλα 2500

for i in range(8-3):
    tokos=poso*0.049
    poso=poso+tokos

# Εμφάνιση
print "Το ποσό μετά από 8 έτη (αφού προστέθηκαν άλλα 2500Ε) θα είναι",poso,"Ευρώ."
print ""

# Footer
print ''
print 'Πω πω μια στροφάρα!!! Έλα γιώργη...'
print 'Ευχαριστούμε για την προτίμησή σας.'
print 'E-mail: iefstathios@gmail.com'
print 'Copyleft 2019, Efstathios Iosifidis'
