# -*- coding: utf-8 -*-

"""  Κάποιος καταθέτει στην τράπεζα 10000€. Το επιτόκιο καταθέσεων είναι 2.9% με τη δέσμευση να μην υπάρξει ανάληψη για χρονικό διάστημα 10 ετών. Κάθε 3 έτη (στο τέλος κάθε έτους) υπολογίζει να καταθέτει επιπλέον 900€ στον λογαριασμό αυτό.
Πόσα χρήματα θα διαθέτει στον λογαριασμό του μετά από 10 έτη;
"""

# Αρχικοποίηση
poso=10000

# Εισαγωγή δεδομένων
for eti in range (1,11):
	poso=poso+poso*0.029
	if eti%3==0:
		poso=poso+900
print ""

# Εμφάνιση
print "Το τελικό ποσό είναι",poso

# Footer
print ''
print 'Ιάσο κόκλα'
print 'Ευχαριστούμε για την προτίμησή σας.'
print 'E-mail: iefstathios@gmail.com'
print 'Copyleft 2019, Efstathios Iosifidis'
