# -*- coding: utf-8 -*-

# Ένας καταναλωτής πηγαίνει στο πολυκατάστημα για ψώνια και έχει στην τσέπη του 500€. Να γραφεί πρόγραμμα το οποίο θα διαβάζει την τιμή του κάθε προϊόντος που αγοράζει και θα τον ειδοποιεί να σταματήσει ώστε να μην ξεπεραστεί το ποσό που έχει διαθέσιμο.

# Αρχικοποίηση
total=0 # Αθροιστής

# Εισαγωγή δεδομένων-Έλεγχος-Επεξεργασία
while total<500: 
    psonia=float(input("Δώσε κόστος προϊόντος:"))
    total=total+psonia
    print ''

# Εμφάνιση
if total>500:
   total=total-psonia
   print 'Άσε πίσω το τελευταίο προϊόν. Ξόδεωες ακριβώς',total,'Ευρώ. Σου περισέψανε',500-total,"Ευρώ"
else:
    print "Ξόδεψες ακριβώς",total,"Ευρώ"


# Footer
print ''
print 'Πω πω μια στροφάρα!!! Έλα γιώργη...'
print 'Ευχαριστούμε για την προτίμησή σας.'
print 'E-mail: iefstathios@gmail.com'
print 'Copyleft 2019, Efstathios Iosifidis'
