# -*- coding: utf-8 -*-

# Να γραφεί πρόγραμμα που θα διαβάζει ένα ακέραιο αριθμό και θα εμφανίζει πόσα είναι τα ψηφία του.

# Εισαγωγή δεδομένων
print 'Θα εισάγετε ένα ακέραιο αριθμό και θα βρω πόσα είναι τα ψηφία του.'
print ''
arithmos=int(input("Δώστε ένα ακέραιο αριθμό:"))
print ''

#Έλεγχος-Επεξεργασία
x=len(str(arithmos))

# Εμφάνιση
print 'Θα σε κουφάνω. Έχει',x,"ψηφία"


# Footer
print ''
print 'Πω πω μια στροφάρα!!! Έλα γιώργη...'
print 'Ευχαριστούμε για την προτίμησή σας.'
print 'E-mail: iefstathios@gmail.com'
print 'Copyleft 2019, Efstathios Iosifidis'
