# -*- coding: utf-8 -*-

# Αρχικοποίηση
psifia=0 # Μετρητής ψηφίων

# Εισαγωγή δεδομένων
print 'Θα εισάγετε ένα ακέραιο αριθμό και θα βρω πόσα είναι τα ψηφία του.'
print ''
arithmos=int(input("Δώστε ένα ακέραιο αριθμό:"))
print ''

#Έλεγχος-Επεξεργασία
x=abs(arithmos) # Παίρνω την απόλυτη τιμή του αριθμού.
while x >= 10**psifia: # Εάν ο αριθμός είναι μεγαλύτερος από την δύμανη του 10 υψωμένη στο σύνολο των ψηφίων
    psifia=psifia+1 # Πρόσθετε ψηφία

# Εμφάνιση
print 'Θα σε κουφάνω. Έχει',psifia,"ψηφία"


# Footer
print ''
print 'Πω πω μια στροφάρα!!! Έλα γιώργη...'
print 'Ευχαριστούμε για την προτίμησή σας.'
print 'E-mail: iefstathios@gmail.com'
print 'Copyleft 2019, Efstathios Iosifidis'
