# -*- coding: utf8 -*-

# Πρόγραμμα 25 μαθητών

sum=0 # μηδενίζω τον μετρητή που θα μου βγάλει τον μο
max=0 # θέτω ως μέγιστο την ελάχιστη βαθμολογία που μπορώ έχω
min=20 # θέτω ως ελάχιστο την μέγιστη βαθμολογία που μπορώ να έχω

# Επαναλήψεις
for i in range(0,25): # επανάληψη για 25 μαθητές
  vathmos=float(input('Δώσε βαθμολογία μαθητή :')) # εισαγωγή βαθμολογίας
  sum=vathmos+sum # μετρητής βαθμολογίας
# Διάφοροι έλεχοι
  if vathmos>max: #έλεγχος για μέγιστο
      max=vathmos #αν αληθής, τότε αυτό είναι το μέγιστο
  if vathmos<min: #έλεγχος για ελάχιστο
      min=vathmos #αν αληθής, τότε αυτό είναι το ελάχιστο

# Υπολογισμός μέσου όρου
mo=sum/25 #υπολογισμός μέσου όρου

# Εκτυπώσεις
print ''
print "Ο μέσος όρος του τμήματος για το μάθημα Προγραμματισμός Υπολογιστών είναι:",round(mo,2)
print ''
print "Η υψηλότερη βαθμολογία είναι η ",max
print ''
print "Η χαμηλότερη βαθμολογία είναι η ",min

# Footer
print ''
print 'Μην παραχαράσετε την ιστορία.'
print 'Ευχαριστούμε για την προτίμησή σας.'
print ''
print 'Copyleft 2019, Efstathios Iosifidis'
