# -*- coding: utf8 -*-
# -*- coding: cp1253 -*-

# Να γραφεί πρόγραμμα σε γλώσσα Python που θα ζητά το αρχικό ενός ονόματος (5 πρώτα γράμματα) και στη συνέχεια θα εμφανίζει  το αντίστοιχο όνομα….
# π.χ. «Α» για Ανδρέας, «Β» για Βάσω, «Γ» για Γιώτα, «Δ» για Δήμητρα, «Ε» για Ευθύμης,
# ή το μήνυμα «Λάθος Αρχικό» για οποιοδήποτε άλλο γράμμα/χαρακτήρα.
# Δε χρειάζεται να γίνει έλεγχος εγκυρότητας δεδομένων

print 'ΕΜΦΑΝΙΣΗ ΟΝΟΜΑΤΟΣ ΜΕΤΑ ΑΠΟ ΕΙΣΑΓΩΓΗ ΑΡΧΙΚΟΥ ΓΡΑΜΜΑΤΟΣ'
print ''
print 'Το πρόγραμμα αυτό ζητάει από τον χρήστη να εισάγει το αρχικό γράμμα ενός ονόματος (από το Α έως το Ε).'
print 'Στη συνέχεια θα εμφανίζει ολόκληρο το όνομα που ξεκινάει από το συγκεκριμένο γράμμα.'
print ''

# Εισαγωγή δεδομένων
name=raw_input('Εισάγετε το αρχικό γράμμα (κεφαλαία και Ελληνικά):') # Εισαγωγή ονόματος

# Εμφάνιση αποτελεσμάτων
if name=='Α':
	print 'Το όνομα είναι Ανδρέας'
elif name=="Β":
	print 'Το όνομα είναι Βάσω'
elif name=='Γ':
	print 'Το όνομα είναι Γιώτα'
elif name=='Δ':
	print 'Το όνομα είναι Δήμητρα'
elif name=='Ε':
	print 'Το όνομα είναι Ευθύμης'
else:
	print 'Δεν κατάλαβα το γράμμα που έδωσες. Παρακαλώ εκτέλεσε ξανά το πρόγραμμα.'
print ''
print ''
print 'Εάν θέλετε άλλο γράμμα, εκτελέστε ξανά το πρόγραμμα.'
print 'Ευχαριστούμε για την προτίμησή σας.'
print 'Copyleft 2018, Efstathios Iosifidis'
