# -*- coding: utf8 -*-
# -*- coding: cp1253 -*-

# Γράψτε ένα πρόγραμμα το οποίο ζητάει από το χρήστη το όνομα και την ηλικία του, μετατρέπει την
# ηλικία του σε ημέρες και τυπώνει ένα κατάλληλο μήνυμα, π.χ. John, you are 11344 days old.

print 'ΥΠΟΛΟΓΙΣΜΟΣ ΗΛΙΚΙΑΣ ΣΕ ΗΜΕΡΕΣ'
print ''
print 'Το πρόγραμμα αυτό ζητάει από τον χρήστη να εισάγει όνομα και ηλικία του.'
print 'Θα μετατρέψει την ηλικία σε ημέρες.'
print 'Θα εμφανίσει μήνυμα που να ενημερώνει πόσων ημερών είναι.'
print ''

# Εισαγωγή δεδομένων
name=raw_input('Εισάγετε το όνομά σας:') # Εισαγωγή ονόματος
age=int(input('Ειάγετε την πραγματική ηλικία σας:')) # Εισαγωγή ηλικίας

# Υπολογισμός δεδομένων
days=age*365

# Εμφάνιση αποτελεσμάτων
print name,' η ηλικία σας σε ημέρες είναι',days
print ''
print ''
print ''
print ''
print 'Εάν κρύψατε κάποια χρόνια, εκτελέστε ξανά το πρόγραμμα.'
print 'Ευχαριστούμε για την προτίμησή σας.'
print 'Copyleft 2018, Efstathios Iosifidis'
