# -*- coding: utf8 -*-
# -*- coding: cp1253 -*-

#Γράψτε εντολές οι οποίες ζητούν από το χρήστη να δώσει ένα γράμμα και ελέγχουν αν είναι φωνήεν
#(a, e, i, o, u) ή σύμφωνο, τυπώνοντας ταυτόχρονα και ένα κατάλληλο μήνυμα. Δεν χρειάζεται να
#ελέγξετε αν ο χαρακτήρας που έδωσε ο χρήστης είναι όντως γράμμα.

print 'ΤΙ ΕΙΝΑΙ ΤΟ ΓΡΑΜΜΑ; ΦΩΝΗΕΝ ή ΣΥΜΦΩΝΟ'
print ''
print 'Το πρόγραμμα αυτό ζητάει από τον χρήστη να εισάγει ένα γράμμα στα αγγλικά.'
print 'Θα ελέξει εάν το γράμμα είναι φωνήεν ή σύμφωνο.'
print 'Θα εμφανίσει μήνυμα που να ενημερώνει τι είναι το γράμμα.'
print 'ΣΗΜΕΙΩΣΗ: Μην εισάγετε γράμματα στα ελληνικά, ούτε νούμερα'
print ''

# Εισαγωγή δεδομένων
gramma=raw_input('Εισάγετε το γραμμα:') # Εισαγωγή ονόματος

# Υπολογισμός δεδομένων
if gramma=='a' or gramma=='e' or gramma=='i' or gramma=='o' or gramma=='u' :
    print 'Το γράμμα που εισάγατε είναι φωνήεν'
else:
    print 'Το γράμμα που εισάγατε είναι σύμφωνο'

print ''
print ''
print ''
print 'Εάν θέλετε για άλλο γράμμα, εκτελέστε ξανά το πρόγραμμα. '
print 'Ευχαριστούμε για την προτίμησή σας.'
print 'Copyleft 2018, Efstathios Iosifidis'
