# -*- coding: utf8 -*-
# -*- coding: cp1253 -*-

#Γράψτε ένα πρόγραμμα το οποίο διαβάζει τρεις πραγματικούς αριθμούς και τυπώνει τον ελάχιστο
#και τον μέσο όρο τους.

print 'ΠΡΑΓΜΑΤΙΚΟΙ ΑΡΙΘΜΟΙ ΚΑΙ ΜΕΣΟΣ ΟΡΟΣ'
print ''
print 'Το πρόγραμμα αυτό ζητάει από τον χρήστη να εισάγει 3 πραγματικούς αριθμούς.'
print 'Τυπώνει τον ελάχιστο και τον μέσο όρο τους.'
print ''

# Εισαγωγή δεδομένων
x=float(input('Εισάγετε έναν αριθμό μάστορα:')) # Εισαγωγή αριθμού 1
y=float(input('Εισάγετε ακόμα έναν αριθμό:')) # Εισαγωγή αριθμού 2
z=float(input('Δεν μου έφτασαν οι δύο. Δώσε ακόμα έναν:')) # Εισαγωγή αριθμού 3

# Υπολογισμός δεδομένων
mo=(x+y+z)/3

# Εμφάνιση
print ''
print ''
if (x<y and x<z):
    print 'Ο ελάχιστος είναι ο',x
elif (y<x and y<z):
    print 'Ο ελάχιστος είναι ο',y
else:
    print 'Ο ελάχιστος είναι ο',z
print ''
print 'Ο μέσος όρος τους είναι:',mo

print ''
print ''
print 'Εάν θέλετε άλλους τρεις αριθμούς, εκτελέστε ξανά το πρόγραμμα. '
print 'Ευχαριστούμε για την προτίμησή σας.'
print 'Copyleft 2018, Efstathios Iosifidis'
