# -*- coding: utf-8 -*-

print '''Ένα ασανσέρ έχει μέγιστο όριο ασφάλειας τα 500 κιλά. Να γράψετε
πρόγραμμα σε Python που θα διαβάζει το βάρος και τη σειρά με την οποία
κάθε άτομο εισέρχεται στο ασανσέρ (π.χ. 45.1, 89.2). Το πρόγραμμα θα
τερματίζει όταν το ασανσέρ γεμίσει (σε σχέση με το μέγιστο επιτρεπτό όριο
ασφαλείας). Στη συνέχεια θα εμφανίζει τη σειρά του τελευταίου ατόμου,
που κατάφερε να μπει στο ασανσέρ.
'''
print ''

# Αθροιστές-Μετρητές
atoma=0 # Μετρητής
maxvaros=500
varos=0 # Μεταβλητή ελέγχου (αθροιστής)
print ''

# Διαβάζει τιμές
while varos<=maxvaros: 
  weight=float(input('Δώσε βάρος ατόμου που θα εισέλθει στον ανελκηστήρα:'))
  atoma=atoma+1 # Προθήκη ενός ατόμου
  varos=varos+weight # Προσθήκη βαρών

# Εμφανιση αποτελεσματων ποσού πληρωμής
print 'Ο τελευταίος που τα κατάφερε να μπει είναι ο:',atoma-1,'ος'
print''
print 'Ο',atoma,'ος να βγει από το ασανσέρ.'

# Footer
print ''
print 'Εν κουλί αυτό;'
print 'Ευχαριστούμε για την προτίμησή σας.'
print 'E-mail: iefstathios@gmail.com'
print 'Copyleft 2019, Efstathios Iosifidis'
