# -*- coding: utf-8 -*-

print '''Ο υπεύθυνος καθηγητής ενός τμήματος 30 μαθητών θέλει να βγάλει ένα στατιστικό
σχετικά με την επίδοση των μαθητών της τάξης του. Να γράψετε πρόγραμμα σε Python
το οποίο
* θα διαβάζει τους μέσους όρους των βαθμών που πήραν οι μαθητές και
* θα υπολογίζει και θα εμφανίζει το πλήθος:
1. αυτών που αρίστευσαν (18<=ΜΟ<=20) ,
2. αυτών που πήραν το χαρακτηρισμό λίαν καλώς (15<=ΜΟ<18),
3. αυτών που πήραν καλώς (12<=ΜΟ<15) και
4. αυτών που πήραν το χαρακτηρισμό Σχεδόν καλώς (10<=ΜΟ<12).'''
print ''

# Αθροιστές-Μετρητές
v20=0 
v17=0 
v16=0 
v11=0
print ''

# Διαβάζει τιμές
for i in range (30):
    vathmos=float(input('Δώσε ΜΟ μαθητή:'))

    while vathmos>20: 
        vathmos=float(input('Δώσε ΜΟ μαθητή (0-20):'))

    if vathmos>=18 and vathmos<=20:
        v20=v20+1
        print "Άριστος"
    elif vathmos>=15 and vathmos<18:
        v17=v17+1
        print "Λίαν Καλώς"
    elif vathmos>=12 and vathmos<15:
        v16=v16+1
        print "Καλώς"
    elif vathmos>=10 and vathmos<12:
        v11=v11+1
        print "Σχεδόν Καλώς"
    

# Εμφανιση αποτελεσματων ποσού πληρωμής
print 'Άριστοι (18<=ΜΟ<=20)',v20
print ''
print 'Λίαν Καλώς (15<=ΜΟ<18)',v17 
print ''
print 'Καλώς (12<=ΜΟ<15)',v16
print ''
print 'Σχεδόν Καλώς (10<=ΜΟ<12)',v11

# Footer
print ''
print 'Μην παραχαράσετε την ιστορία.'
print 'Ευχαριστούμε για την προτίμησή σας.'
print 'E-mail: iefstathios@gmail.com'
print 'Copyleft 2019, Efstathios Iosifidis'
