# -*- coding: utf-8 -*-

# Αρχικοποίηση
sum=0.0 # Αθροιστής
maxage=0 # Έστω ότι η μέγιστη ηλικία είναι 0
pano50=0 # Μετρητής
AGES=[] # Δημιουργία Λίστας

# Εισαγωγή δεδομένων
for i in range(100): # Κάνε 100 επαναλήψεις
    age=int(input("Δώσε ηλικία:")) # Διαβάζει ηλικίες
    print ""
    AGES.append(age) # Προσθέτει τον ηλικία στην λίστα

# Ερώτημα α
for age in AGES: # Για κάθε ηλικία από την λίστα AGES
    sum=sum+age
mo=sum/100 # Υπολογισμός μέσου όρου. Το sum το έχω ορίσει ως float στην αρχικοποίηση
print "Ο μέσος όρος των ηλικιών είναι:",mo


# Ερώτημα β
for age in AGES: # Για κάθε ηλικία από την λίστα AGES
    if age>maxage: # Έλεξε εάν η κάθε ηλικία είναι μεγαλύτερη του maxage
        maxage=age # Τότε το maxage είναι ίσο με την ηλικία που έγινε η σύγκριση   
print "Η μέγιστη ηλικία είναι:",maxage

# Ερώτημα γ
for age in AGES: # Για κάθε ηλικία από την λίστα AGES
    if age>=50: # Εάν η ηλικία είναι πάνω από 50
        pano50=pano50+1 # Πρόσθεσε ένα
print "Το πλήθος των ανθρώπων που είναι πάνω από 50 είναι:",pano50


# Footer
print ''
print 'Πω πω μια στροφάρα!!! Έλα γιώργη...'
print 'Ευχαριστούμε για την προτίμησή σας.'
print 'E-mail: iefstathios@gmail.com'
print 'Copyleft 2019, Efstathios Iosifidis'
