# -*- coding: utf-8 -*-

# Αρχικοποίηση
ONOMA=[] # Δημιουργώ λίστα
ETH_YPHR=[] # Δημιουργώ λίστα
MIS8OS=[] # Δημιουργώ λίστα
sum=0.0 # Αθροιστής

# Εισαγωγή δεδομένων
for i in range(2300): # Κάνε 2300 επαναλήψεις
    name=raw_input("Δώσε όνομα υπαλλήλου:") # Εισαγωγή ονόματος
    ONOMA.append(name) # Πρόσθεσε το όνομα στην λίστα
    print ""
    eti=float(input("Δώσε έτη εργασίας:")) # Εισαγωγή έτους
    ETH_YPHR.append(eti) # Προσθήκη έτους στην λίστα
    print ""
    misthos=float(input("Δώσε μισθό:")) # Εισαγωγή μισθού
    MIS8OS.append(misthos) # Προσθήκη μισθού στην λίστα
    print ""
    
# Ερώτημα α
for i in range(2300): # Κάνε 2300 επαναλήψεις
    if ETH_YPHR[i]>=6 and ETH_YPHR[i]<=11: # Εάν τα έτη υπηρεσίας βρίσκονται μεταξύ 6 και 11
        miosi=MIS8OS[i]*0.06 # Υπολόγισε την μείωση μισθού
        MIS8OS[i]=MIS8OS[i]-miosi # Υπολόγισε τον νέο μισθό
        #MIS8OS.insert(i,MIS8OS[i]) # Πρόσθεσε το νέο μισθό στην λίστα στην θέση που ήταν
        #MIS8OS.pop(i+1) # Αφαίρεσε τον παλιό μισθό που μετακινήθηκε μια θέση προς τα πάνω (+1)
        sum=sum+miosi # Πρόσθεσε το σύνολο της μείωσης στον αθροιστή (ερώτημα δ)
    elif ETH_YPHR[i]>=12 and ETH_YPHR[i]<=18: # Εάν τα έτη είναι μεταξύ 12 και 18
        miosi=MIS8OS[i]*0.12 # Υπολόγισε την μείωση του μισθού
        MIS8OS[i]=MIS8OS[i]-miosi # Υπολόγισε τον νέο μισθό
        #MIS8OS.insert(i,MIS8OS[i]) # Πρόσθεσε το νέο μισθό στην λίστα στην θέση που ήταν
        #MIS8OS.pop(i+1) # Αφαίρεσε τον παλιό μισθό που μετακινήθηκε μια θέση προς τα πάνω (+1)
        sum=sum+miosi # Πρόσθεσε το σύνολο της μείωσης στον αθροιστή (ερώτημα δ)
    elif ETH_YPHR[i]>18: # Εάν τα έτη είναι πάνω από 18
        miosi=MIS8OS[i]*0.17 # Υπολόγισε την μείωση μισθού
        MIS8OS[i]=MIS8OS[i]-miosi # Υπολόγισε τον νέο μισθό
        #MIS8OS.insert(i,MIS8OS[i]) # Πρόσθεσε το νέο μισθό στην λίστα στην θέση που ήταν
        #MIS8OS.pop(i+1) # Αφαίρεσε τον παλιό μισθό που μετακινήθηκε μια θέση προς τα πάνω (+1)
        sum=sum+miosi # Πρόσθεσε το σύνολο της μείωσης στον αθροιστή (ερώτημα δ)
    else: # Εάν είναι κάτω από 6 έτη
        MIS8OS[i]=MIS8OS[i] # Ο μισθός θα είναι ίδιος.

        
print "Οι μισθοί θα είναι:",MIS8OS
print ""

# Ερώτημα β
max=0 # Θέτω το μέγιστω ως 0
min=misthos # Το ελάχιστο ίσο με τον τελευταίο μισθό που εισήχθη
maxname=name # Το όνομα του εργαζομένου με τον μέγιστο μισθό είναι ίσο με το τελευταίο όνομα που εισήχθη
minname=name # Το όνομα του εργαζομένου με τον ελάχιστο μισθό είναι ίσο με το τελευταίο όνομα που εισήχθη
for i in range(2300): # Κάνε 2300 επαναλήψεις
    if MIS8OS[i]>max: # Εάν ο μισθός είναι μεγαλύτερος από τον max
        max=MIS8OS[i] # Το νέο max είναι ίσο με τον μισθό
        maxname=ONOMA[i] # Και κρατάμε το όνομα του υπαλλήλου με τον μεγαλύτερο μισθό
    if MIS8OS[i]<min: # Εάν ο μισθός είναι μικρότερος από τον min
        min=MIS8OS[i] # Τότε νέο min θα είναι ίσο με τον μισθό
        minname=ONOMA[i] # Και κρατάμε το όνομα του υπαλλήλου με τον μικρότερο μισθό

print "Ο υπάλληλος",maxname,"έχει τον υψηλότερο μισθό μετά την μείωση. Λαμβάνει",max,"Ευρώ"
print ""
print "Ο υπάλληλος",minname,"έχει τον χαμηλότερο μισθό μετά την μείωση. Λαμβάνει",min,"Ευρώ"
print ""

# Ερώτημα γ
mesimiosi=sum/2300 # Υπολογισμός της μέσης μείωσης (το sum είναι float γιατί μετράμε μισθό που δηλώθηκε ως float)
print "Η μέση μείωση μισθού είναι:",mesimiosi,"Ευρώ"
print ""

# Ερώτημα δ
print "Τα κέρδη της εταιρίας ήταν:",sum

# Footer
print ''
print 'Πω πω μια στροφάρα!!! Έλα γιώργη...'
print 'Ευχαριστούμε για την προτίμησή σας.'
print 'E-mail: iefstathios@gmail.com'
print 'Copyleft 2019, Efstathios Iosifidis'
