# -*- coding: utf8 -*-

# Πρόγραμμα ρύπων
print "To Υπουργείο Περιβάλλοντος αποφάσισε να παρακολουθήσει για τριάντα (30) ημέρες τα επίπεδα ενός ρύπου στην ατμόσφαιρα, πραγματοποιώντας μία μέτρηση την ημέρα."
print ""
print "Δ1. Για κάθε μία από τις τριάντα (30) ημέρες (μον. 1) να διαβάζει την τιμή του ρύπου με τη χρήση κατάλληλου μηνύματος (δε χρειάζεται να γίνεται έλεγχος ορθότητας τιμών)"
print ""
print "Δ2. Να εμφανίζει για κάθε μέρα το επίπεδο μόλυνσης ανάλογα με την τιμή του ρύπου."
print ""
print "Δ3. Να υπολογίζει και να εμφανίζει το πλήθος των ημερών κατά τη διάρκεια των οποίων η τιμή του ρύπου ξεπέρασε την τιμή 3."
print ""
print "Δ4. Να υπολογίζει και να εμφανίζει τον μέσο όρο των τιμών του ρύπου για το διάστημα των τριάντα (30) ημερών."
print ""

ep=0 # Δ3 (μηδενισμός μετρητή ημέρας που είχε τιμή πάνω από 3)
sum=0 # Δ4 (μηδενισμός μετρητή τιμής)
for i in range(0,30): #Δ1 (30 επαναλήψεις)
  ripos=float(input('Δώσε τιμή ρύπου :')) # Δ1 (ερώτηση τιμής για 30 φορές)
  if ripos<=1: #Δ2 (έλεγχος τιμής)
    print "Φυσιολογικό" # Δ2 (εμφάνιση επιπέδου μόλυνσης)
  elif ripos<=2: #Δ2 (έλεγχος τιμής)
    print "Οριακό" # Δ2 (εμφάνιση επιπέδου μόλυνσης)
  else: #Δ2 (έλεγχος τιμής)
    print "Επικύνδυνο" # Δ2 (εμφάνιση επιπέδου μόλυνσης)
    if ripos>3: # Δ3 (έλεγχος για τιμή πάνω από 3)
      ep=ep+1 # Δ3 (μέτρηση ημέρας που είχε τιμή πάνω από 3)
  sum=sum+ripos # Δ4 (μετρητής τιμών)

mo=sum/30 # Δ4 ()Υπολογισμός μέσου όρου 30 ημερών)

print ""
print "Οι ημέρες που ο ρύπος ξεπέρασε την τιμή 3, είναι ",ep # Δ3 (εμφάνιση ημερών για τιμή πάνω από 3)
print ""
print "Ο μέσος όρος των ρύπων τις 30 ημέρες είναι ",round(mo,2) # Δ4 (εμφάνιση μέσου όρου τιμών για 30 ημέρες)

# Footer
print ''
print ''
print 'Μην παραχαράσετε την ιστορία.'
print 'Ευχαριστούμε για την προτίμησή σας.'
print ''
print 'Copyleft 2019, Efstathios Iosifidis'
