# -*- coding: utf-8 -*-

# Μια μπάλα αφήνεται να πέσει από ύψος 500 μέτρων. Έπειτα από κάθε πρόσκρουση στο έδαφος αναπηδά σε ύψος 15% μικρότερο σε σχέση με το προηγούμενο ύψος. Να αναπτύξετε πρόγραμμα που θα υπολογίζει το ύψος της μπάλας έπειτα από 10 προσκρούσεις της στο έδαφος.

# Αρχικοποίηση
ypsos=500
anapidisi=0

# Έλεγχος-Επεξεργασία
while anapidisi<10:
    ypsos=ypsos-ypsos*0.15
    anapidisi=anapidisi+1


# Εμφάνιση
print ""
print 'Μετά από 10 προσκορούσες της μπάλας στο έδαφος, αυτή θα έχει ύψος',ypsos,"μέτρα"



# Footer
print ''
print 'Πω πω μια στροφάρα!!! Έλα γιώργη...'
print 'Ευχαριστούμε για την προτίμησή σας.'
print 'E-mail: iefstathios@gmail.com'
print 'Copyleft 2019, Efstathios Iosifidis'
