# -*- coding: utf-8 -*-

# Με την εκκίνηση της συσκευής ενός κινητού ζητείται ο κωδικός πρόσβασης ΡΙΝ και ο χρήστης έχει τρείς ευκαιρίες για την εισαγωγή του. Να αναπτύξετε τον αλγόριθμο που εκτελεί το κινητό: ζητάει το πολύ 3 φορές τον κωδικό πρόσβασης (αν δεν εισαχθεί σωστά). Αν πραγματοποιηθεί επιτυχής εισαγωγή, εμφανίζει "Καλώς ήρθατε", ενώ στην περίπτωση τριπλής αποτυχίας εμφανίζει το μήνυμα "Κάρτα κλειδώθηκε. Εισάγετε PUK". Να θεωρήσετε δεδομένο τον ΡΙΝ του κινητού τηλεφώνου.

# Αρχικοποίηση
success=False # Flag (Σημαία)
tries=1 # Μετρητής
code=0000 # Αυτό είναι το PIN

# Εισαγωγή δεδομένων-Έλεγχος-Επεξεργασία-Εμφάνιση
while tries<=3 and success==False:
    pin=int(input("Δώσε το PIN:"))
    print ''
    if pin==code:
        print "Καλώς ήλθατε"
        success=True
    tries=tries+1

print ''
if success==False and tries>3:
    print "Κάρτα κλειδώθηκε. Εισάγετε PUK"


# Footer
print ''
print 'Πω πω μια στροφάρα!!! Έλα γιώργη...'
print 'Ευχαριστούμε για την προτίμησή σας.'
print 'E-mail: iefstathios@gmail.com'
print 'Copyleft 2019, Efstathios Iosifidis'
