# -*- coding: utf-8 -*-

"""  Στον τελικό του αγωνίσματος της σφαιροβολίας κάθε αθλητής έχει στη διάθεσή του 3 ρίψεις. Να αναπτυχθεί πρόγραμμα που θα διαβάζει το όνομα και τα αποτελέσματα των ρίψεων για καθέναν από τους 15 αθλητές και θα εκτυπώνει το όνομα και την επίδοση του αθλητή με τη χειρότερη, καθώς και αυτού με την καλύτερη επίδοση.
"""

# Αρχικοποίηση
min=10000
max=0

# Εισαγωγή δεδομένων
for i in range(15):
	name=raw_input("Δώσε όνομα αθλητή:")
	for j in range(3):
		ripsi=float(input("Δώσε αποτέλεσμα ρίψης:"))
		if ripsi>max:
			max=ripsi
			max_name=name # Δεν χρειάζεται αρχικοποίηση διότι είναι μεταβλητή που παίρνει τιμή πρώτη φορά εδώ.
		if ripsi<min:
			min=ripsi
			min_name=name
print ""

# Εμφάνιση
print "Την μέγιστη επίδοση την πέτυχε ο",max_name
print ""
print "Ενώ την μικρότερη επίδοση την πέτυχε ο",min_name

# Footer
print ''
print 'Ιάσο κόκλα'
print 'Ευχαριστούμε για την προτίμησή σας.'
print 'E-mail: iefstathios@gmail.com'
print 'Copyleft 2019, Efstathios Iosifidis'
