# -*- coding: utf-8 -*-

# Ένας καταναλωτής πηγαίνει στο πολυκατάστημα για ψώνια και έχει στην τσέπη του 500€. Να γραφεί πρόγραμμα το οποίο θα διαβάζει την τιμή του κάθε προϊόντος που αγοράζει και θα τον ειδοποιεί να σταματήσει ώστε να μην ξεπεραστεί το ποσό που έχει διαθέσιμο.

# Αρχικοποίηση
total=0 # Αθροιστής

# Εισαγωγή δεδομένων-Έλεγχος-Επεξεργασία
psonia=float(input("Δώσε κόστος προϊόντος:"))
while total+psonia<500: # Εδώ θέλουμε να μπούμε στην επανάληψη.
	total=total+psonia
	psonia=float(input("Δώσε κόστος επόμενου προϊόντος:"))
print ''

# Εμφάνιση
print "ΤΕΛΟΣ ΑΓΟΡΩΝ"


# Footer
print ''
print 'Πω πω μια στροφάρα!!! Έλα γιώργη...'
print 'Ευχαριστούμε για την προτίμησή σας.'
print 'E-mail: iefstathios@gmail.com'
print 'Copyleft 2019, Efstathios Iosifidis'
