# -*- coding: utf-8 -*-

# Ένα ασανσέρ έχει όριο βάρους τα 350 κιλά. Να γράψετε πρόγραμμα το οποίο θα ελέγχει πόσα άτομα μπορούν να εισέλθουν, διαβάζοντας το βάρος του εισερχόμενου ατόμου μέχρι να αποφασίσει ότι δεν επιτρέπεται η είσοδος σε άλλον, οπότε και θα εμφανίζει το συνολικό βάρος και τον αριθμό των ατόμων μέσα στο ασανσέρ. 

# Εισαγωγή δεδομένων
atoma=0 # Μετρητής
maxvaros=350
varos=0 # Μεταβλητή ελέγχου (αθροιστής)
print ''

#Έλεγχος-Επεξεργασία
weight=float(input('Δώσε βάρος ατόμου που θα εισέλθει στον ανελκηστήρα:'))
while varos-weight<maxvaros: 
  atoma=atoma+1 # Προθήκη ενός ατόμου
  varos=varos+weight # Προσθήκη βαρών
  weight=float(input('Δώσε βάρος επόμενου ατόμου που θα εισέλθει στον ανελκηστήρα:'))
  if varos+weight>350:
	print "Δε χωράει άλλος"

# Εμφάνιση
print 'Χώρεσε',atoma,'και το συνολικό βάρος τους είναι',varos


# Footer
print ''
print 'Πω πω μια στροφάρα!!! Έλα γιώργη...'
print 'Ευχαριστούμε για την προτίμησή σας.'
print 'E-mail: iefstathios@gmail.com'
print 'Copyleft 2019, Efstathios Iosifidis'
