# -*- coding: cp1253 -*-

print 'Το πρόγραμμα χρησιμοποιείται για υπολογισμό πληρωταίου ποσού σε κατάστημα λιανικής.'
print ''
print 'Αρχικά ζητείται να εισάγετε την ποσότητα που θέλει ο πελάτης (σε κιλά ή τεμάχια).'
print ''
print 'Ακολουθεί η εισαγωγή της τιμής προϊόντος (ανά κιλό ή τεμάχιο).'
print ''
print 'Γίνεται ο υπολογισμός του κόστους συν το ΦΠΑ 24% και το εμφανίζει στην οθόνη.'
print ''
print 'Στην συνέχεια ζητείται να εισάγετε το ποσό των χρημάτων που σας έδωσε ο πελάτης.'
print ''
print 'Και ολοκληρώνεται με την εμφάνιση του ποσού των χρηματων που επιστρέφετε ως ρέστα.'
print ''
print 'Στην εμφάνιση του κόστους καθώς και των ρέστων, γίνεται στρογγυλοποίηση 2 δεκαδικών.'
print ''
print ''

# Διαβάζει τιμές και ποσότητα προϊόντος
posotita=float(input('Δώστε την ποσότητα που πήρε ο πελάτης (κιλά ή τεμάχια):')) # Μπορεί να είναι και δεκαδικό (πχ κιλά)
timi=float(input('Δώστε τιμή ποσότητας προϊόντος (ανά κιλό ή ανά τεμάχιο):')) # Σίγουρα μπορεί να είναι δεκαδικό.

# Υπολογισμοί ποσού πληρωμής και συνολικού ποσού με ΦΠΑ
fpa=24/100 # Εισάγουμε μεταβλητή για το ΦΠΑ γιατί εάν αλλάξει στο μέλλον, το αλλάζουμε εδώ.
kostos=posotita*timi
kostosfpa=kostos*fpa
total=kostos+kostosfpa
#total=timi*posotita*1.24 Εάν θέλουμε να κάνουμε υπολογισμό σε μια γραμμή

# Εμφανιση αποτελεσματων ποσού πληρωμής
print 'Το συνολικό ποσό πληρωμής με ΦΠΑ είναι:',round(total,2),'€' # Με την round στρογγυλοποιώ σε 2 δεκαδικά ψηφία
print ''
print 'Το ποσό ΦΠΑ είναι',kostosfpa,'€. Άρα χωρίς απόδειξη θα του κοστίσει',round(kostos,2),'€' # Με την round στρογγυλοποιώ σε 2 δεκαδικά ψηφία
print ''

# Ερώτηση και υπολογισμός ρέστων
lefta=float(input('Πόσα χρήματα έδωσε ο πελάτης;'))
resta=lefta-total
print 'Τα ρέστα με απόδειξη είναι:',round(resta,2),'€' # Με την round στρογγυλοποιώ σε 2 δεκαδικά ψηφία
print 'Τα ρέστα χωρίς απόδειξη είναι:',round(lefta-kostos,2),'€' # Με την round στρογγυλοποιώ σε 2 δεκαδικά ψηφία

# Footer
print ''
print ''
print 'Εάν θέλετε εκτελέστε ξανά το πρόγραμμα για άλλα προϊόντα.'
print 'Ευχαριστούμε για την προτίμησή σας.'
print ''
print 'Copyleft 2018, Efstathios Iosifidis'

