#!/usr/bin/python3
# -*- coding: cp1253 -*-
# Filename: while.py

number = int(input('Δώστε έναν ακαίρεο από το 1 έως το 100: '))

# πως θα σβηστει ο αριθμός;

guess = int(input('Εισάγετε έναν ακέραιο αριθμό : '))

if guess == number:
    print('Συγχαρητήρια, τον μαντέψατε.')

elif guess < number:
    print('Όχι, ο αριθμός που ψάχνουμε είναι μεγαλύτερος.')

else:
    print('Όχι, ο αριθμός που ψάχνουμε είναι μικρότερος.')

print('Τέλος')
# Η τελευταία αυτή εντολή εκτελείται πάντα μετά την εκτέλεση της εντολής if
