# -*- coding: utf-8 -*-

print '''Το πρόγραμμα χρησιμοποιείται για υπολογισμό πληρωταίου ποσού σε κατάστημα λιανικής.
1. Αρχικά ζητείται να εισάγετε την τιμή και την ποσότητα που θέλει ο πελάτης.
2. Όταν η τιμή προϊόντος είναι 0 τότε σταματάει η εισαγωγή προϊόντων.
3. Εισάγουμε και την ποσότητα σε τεμάχια (αν η τιμή προϊόντος δεν είναι 0).
4. Υπολογίζει το συνολικό ποσό και το σύνολο των προϊόντων που ψώνισε. 
5. Εμφανίζει τον αριθμό των προϊόντων που αγόρασε ο πελάτης
6. Εμφανίζει το συνολικό ποσό πληρωμής (συν το ΦΠΑ).
7. Στην συνέχεια ζητείται να εισάγετε το ποσό των χρημάτων που σας έδωσε ο πελάτης.
8. Και ολοκληρώνεται με την εμφάνιση του ποσού των χρηματων που επιστρέφετε ως ρέστα.
ΣΗΜΕΙΩΣΗ: Στην εμφάνιση του κόστους καθώς και των ρέστων, γίνεται στρογγυλοποίηση 2 δεκαδικών.'''
print ''

# Μετρητές
pliroteo=0
proionta=0
kostos=0

# Διαβάζει τιμές και ποσότητα προϊόντος υπολογίζει τους μετρητές
while True:
    print ''
    timi=float(input('Δώστε τιμή ποσότητας προϊόντος (ανά τεμάχιο) ή 0 για έξοδο: ')) # Σίγουρα μπορεί να είναι δεκαδικό.
    print ''
    if timi!=0:
        posotita=int(input('Δώστε την ποσότητα που πήρε ο πελάτης (τεμάχια): ')) # Δεν πρέπει να είναι τεμάχια+κιλά γιατί θα μπερδευτεί.
        kostos=posotita*timi
        pliroteo=pliroteo+kostos
        proionta=proionta+posotita
    else:
        break

# Πράξεις
fpa=24/100 # Το ΦΠΑ το βάζω ως ξεχωριστή μεταβλητή γιατί στην ελλάδα είναι μεταβλητή...
total=pliroteo+pliroteo*fpa

# Εμφανιση αποτελεσματων ποσού πληρωμής
print 'Θέλετε απόδειξη;'
print ''
print '1. Ναι'
print ''
print '2. Όχι'
print ''

while True:
    apodeiksi=int(input('Δώσε επιλογή 1 ή 2: '))
    if apodeiksi==1: # Μέ απόδειξη             
        print 'Αγόρασες ',proionta,' τεμάχια'
        print ''
        print 'Το συνολικό ποσό πληρωμής με ΦΠΑ είναι: ',round(total,2),' €'
        print ''
        lefta=float(input('Μάστορα, δώσε μπικικίνια: '))
        print ''
        print 'Τα ρέστα με απόδειξη είναι:',round(lefta-total,2),' €'
        print 'Ευχαριστούμε'
        break
    elif apodeiksi==2: # Χωρίς απόδειξη
        print 'Αγόρασες ',proionta,' τεμάχια'
        print ''
        print 'Το ποσό ΦΠΑ είναι ',pliroteo*fpa,' €. Άρα χωρίς απόδειξη θα του κοστίσει μόνο ',round(pliroteo,2),' €'
        print ''
        lefta=float(input('Μάστορα, δώσε μπικικίνια: '))
        print ''
        print 'Τα ρέστα σου είναι:',round(lefta-pliroteo,2),'€'
        print 'Ευχαριστούμε'
        break
    else:
        apodeiksi=int(input('Δώσε επιλογή 1 ή 2: '))

# Footer
print ''
print 'Μην παραχαράσετε την ιστορία.'
print 'Ευχαριστούμε για την προτίμησή σας.'
print 'E-mail: iefstathios@gmail.com'
print 'Copyleft 2019, Efstathios Iosifidis'

