# -*- coding: cp1253 -*-
# -*- coding: utf8 -*-

print 'ΕΡΩΤΗΣΗ ΗΛΙΚΙΑΣ'
print ''
print 'Το πρόγραμμα αυτό ζητάει από τον χρήστη να εισάγει την ηλικία του.'
print 'Θα ελέξει εάν είναι ανήλικος, ενήλικος ή υπερήλικας.'
print 'Θα εμφανίσει μήνυμα που να ενημερώνει τι είναι.'
print ''

# Εισαγωγή δεδομένων
age=int(input('Δώσε ηλικία σου:')) # Εισαγωγή ηλικίας
print ''

# Εμφάνιση αποτελεσμάτων
if age<18 :
    print 'Είσαι ανήλικος μάστορα...'
elif age>=18 and age<65:
    print 'Είσαι ενήλικος...'
else:
    print 'Είσαι μαθουσάλας!!!'

print ''
print ''
print ''
print 'Εάν άλλες ηλικίες, εκτελέστε ξανά το πρόγραμμα. '
print 'Ευχαριστούμε για την προτίμησή σας.'
print 'Copyleft 2018, Efstathios Iosifidis'
