# -*- coding: cp1253 -*-

print 'Ένα απλό προγραμματάκι που σας ζητάει να εισάγετε 2 ακέραιους αριθμούς.'
print 'Στη συνέχεια υπολογίζει τις εξής πράξεις:'
print '1. Πρόσθεση'
print '2. Αφαίρεση'
print '3. Πολλαπλασιασμό'
print '4. Διαίρεση'
print ''

# Εισαγωγή δεδομένων
x=int(input('Εισάγετε ένα ακέραιο αριθμό:'))
y=int(input('Ευχαριστώ, αλλά θέλω ακόμα ένα ακέραιο:'))

# Επεξεργασία δεδομένων
prosthesi=x+y # Πρόσθεση
afairesi=x-y # Αφαίρεση
ginomeno=x*y # Πολλαπλασιασμός
piliko=x/y # Διαίρεση

# Εμφάνιση αποτελεσμάτων δεδομένων
print 'Ο Στάθης σας ενημερώνει ότι η ΠΡΟΣΘΕΣΗ των αριθμών που εισάγατε δίνει αποτέλεσμα:',prosthesi
print 'Ο Στάθης έκανε και την ΑΦΑΙΡΕΣΗ και το αποτέλεσμα είναι:',afairesi
print 'Στον ΠΟΛΛΑΠΛΑΣΙΑΣΜΟ άρχισαν λίγο οι πράξεις με τα χέρια, λίγο το κομπιουτεράκι αλλά ο Στάθης βρήκε αποτέλεσμα:',ginomeno
print 'Ο Στάθης δυσκολεύτηκε λίγο αλλά ΔΙΑΙΡΕΣΕ τον πρώτο διά τον δεύτερο και βρήκε αποτέλεσμα:',piliko
print ''
print 'Εάν θέλετε ξαναεκτελέστε το πρόγραμμα για άλλα νούμερα. Ευχαριστούμε για την προτίμησή σας.'
print ''
print 'Copyleft 2018, Efstathios Iosifidis'
