# -*- coding: utf-8 -*-

print '''Για κάθε μαθητή δίνονται τα στοιχεία: ονοματεπώνυμο, προφορικός και γραπτός βαθμός ενός μαθήματος. 
Να γραφτεί πρόγραμμα σε Python που να εκτελεί τις παρακάτω λειτουργίες:
1) Να διαβάζει τα στοιχεία πολλών μαθητών και σταματά, όταν δοθεί ως ονοματεπώνυμο το κενό.
2) Να ελέγχει αν ο προφορικός και ο γραπτός βαθμός είναι από 0 μέχρι 20. Στην περίπτωση που δεν είναι ο βαθμός στα επιτρεπτά όρια, να ξαναδιαβάζεται ο βαθμός μέχρι να δώσουμε τον σωστό βαθμό.
3) Να υπολογίζει τον τελικό βαθμό του μαθήματος, ο οποίος είναι άθροισμα του 30% του προφορικού βαθμού και του 70% του γραπτού βαθμού. Επίσης, να εμφανίζει το ονοματεπώνυμο του μαθητή και τον τελικό βαθμό του μαθήματος.
4) Να υπολογίζει και να εμφανίζει το πλήθος των μαθητών που έχουν βαθμό μεγαλύτερο του 18
'''
print ''

# Αθροιστές-Μετρητές 
mathites18=0 # Μετρητής μαθητών με βαθμό πάνω από 18 (ερώτημα 4)


# Διαβάζει τιμές
onoma=raw_input('Δώσε όνομα μαθητή (enter για έξοδο): ')
print ''
while onoma!='':
    proforika = float(input('Δώσε βαθμό μαθητή στα προφορικά (0-20): '))
    print ''
    while proforika<0 or proforika>20:
        proforika = float(input('Δώσε σωστό βαθμό μαθητή στα προφορικά (0-20): '))
    print ''
   
    grapta = float(input('Δώσε βαθμό μαθητή στα γραπτά (0-20): '))
    print ''
    while grapta<0 or grapta>20:
        grapta = float(input('Δώσε σωστό βαθμό μαθητή στα γραπτά (0-20): '))
    print ''
    

    vathmos = proforika*0.30+grapta*0.70
    print 'Ο τελικός βαθμός του ',onoma,' είναι ',round(vathmos,2)
    print ''
    if vathmos>18:
        mathites18 = mathites18+1

    onoma = raw_input('Δώσε όνομα μαθητή (enter για έξοδο): ')
    print ''


# Εμφανιση αποτελεσματων
print 'Οι μαθητές με τελικό βαθμό πάνω από 18 είναι: ',mathites18


# Footer
print ''
print 'Εν κουλί αυτό;'
print 'Ευχαριστούμε για την προτίμησή σας.'
print 'E-mail: iefstathios@gmail.com'
print 'Copyleft 2019, Efstathios Iosifidis'
