# -*- coding: utf-8 -*-

print '''Σε ένα πλοίο υπάρχουν εισιτήρια Α' Θέσης (κωδικός 0) προς 50€ και 
Β' θέσης (κωδικός 1) προς 20€, το ένα. Ο μέγιστος επιτρεπόμενος αριθμός
επιβατών είναι 400 άτομα και θεωρούμε ότι τελικά το πλοίο γέμισε για το
συγκεκριμένο προορισμό που εξετάζουμε. Να γράψετε πρόγραμμα σε Python, το οποίο:
1) Να διαβάζει την κατηγορία εισιτηρίου (κωδικός 0 ή 1) για κάθε επιβάτη.
2) Να εμφανίζει το πλήθος των επιβατών της Α' και Β' θέσης.
3) Να εμφανίζει το συνολικό ποσό που πλήρωσαν όλοι οι επιβάτες..'''
print ''

# Αθροιστές-Μετρητές
epivatesb=0 # Αθροιστής επιβατών Β θέσης
epivatesa=0 # Αθροιστής επιβατών Α θέσης
athesi=50 # Τιμή εισητηρίου Α θέσης. Το βάζω εδώ σε περίπτωση που θέλω να αλλάξω την τιμή Α θέσης στο μέλλον.
bthesi=20 # Τιμή εισητηρίου Β θέσης. Επίσης για μελλοντική αλλαγή τιμής
print ''

# Διαβάζει τιμές
while (epivatesa+epivatesb)<400: # Αν το άθροισμα των επιβατών είναι κάτω από 400 να εκτελεί τον βρόγχο. Δεν έβαλα = γιατί μου προσθέτει ακόμα ένα ταξιδιώτη.
  thesi=int(input('Δώσε τι θέση θέλει ο τουρίστας:\n0 για Α θέση και\n1 για Β θέση\nΕπιλογή: ')) # Ερώτηση για την θέση
  if thesi==0: # Αν δώσει τιμή 0 (Α θέση)
    print ''
    print 'Ταξιδεύει Α θέση' # Εκτυπώνει ότι ταξιδεύει Α θέση
    print ''
    epivatesa=epivatesa+1 # Προσθέτει έναν επιβάτη στην Α θέση
  elif thesi==1: # Αν δώσει τιμή 1 (Β Θέση)
    print ''
    print 'Ταξιδεύει Β Θέση' # Εκτυπώνει ότι ταξιδεύει Β θέση
    print ''
    epivatesb=epivatesb+1 # Προσθέτει έναν επιβάτη στην Β θέση
  else: # Αν δώσει οποιονδήποτε άλλον αριθμό, απλά  δεν προσθέτει κανέναν επιβάτη στους αθριστές
    print ''
    print 'Δεν έδωσες σωστή θέση' # Του εκτυπώνει ότι έκανε λάθος. Δεν υπάρχει και τον πάει επάνω.
    print ''


# Πράξεις
total=epivatesa*athesi+epivatesb*bthesi # Υπολογίζω το ποσό πληρωμής

# Εμφανιση αποτελεσματων ποσού πληρωμής
print 'Οι επιβάτες είναι',epivatesa+epivatesb # Εμφανίζω το σύνολο των επιβατών
print ''
print 'Οι επιβάτες Α θέσης είναι',epivatesa # Εμφανίζω τους επιβάτες Α θέσης
print ''
print 'Οι επιβάτες Β θέσης είναι',epivatesb # Εμφανίζω τους επιβάτες Β Θέσης
print ''
print 'Το συνολικό ποσό που θα πληρώσουν είναι:',total,'ευρώπουλα' # Εμφανίζω το συνολοκό ποσό πληρωμής

# Footer
print ''
print 'Μην παραχαράσετε την ιστορία.'
print 'Ευχαριστούμε για την προτίμησή σας.'
print 'E-mail: iefstathios@gmail.com'
print 'Copyleft 2019, Efstathios Iosifidis'

