# -*- coding: cp1253 -*-
'''
Δίνεται το παρακάτω πρόγραμμα, στο οποίο το τμήμα δήλωσης μεταβλητών είναι κενό:
'''
Α = input('Εισάγετε τιμή')
Β = input('Εισάγετε τιμή')
C = raw_input(“Εισάγετε τιμή”)
Μ = ( Α + Β ) / 2
if C >= 'Α' and  C < 'Μ' :
    D = True
else:
    D = Μ < 0
print Μ, D
'''
Να δώσετε ένα παράδειγμα από το πρόγραμμα για:
 
1.	αλφαριθμητική σταθερά
2.	λογική σταθερά
3.	αριθμητική μεταβλητή
4.	αλφαριθμητική μεταβλητή
5.	λογικό τελεστή
6.	αριθμητική έκφραση
7.	λογική έκφραση
8. 	σύνθετη έκφραση
'''

1. 'Α', 'Μ', 'Εισάγετε τιμή'
2. True
3. A, B, M
4. C
5. and
6. ( Α + Β ) / 2
7. C >= 'Α', C < 'Μ', Μ < 0
8. C >= 'Α' and  C < 'Μ'
