# -*- coding: cp1253 -*-
'''
Δίνονται τα παρακάτω στοιχεία που χρησιμοποιούνται σε πρόγραμμα PYTHON:
	Λίστα 10 στοιχείων: L 
	Λογική μεταβλητή: found
	Ακέραια μεταβλητή: i
Να μετατρέψετε τις ενέργειες που δίνονται παρακάτω, σε εντολές της PYTHON,
χρησιμοποιώντας αποκλειστικά και μόνο την εντολή εκχώρησης
(χωρίς δομή επιλογής ή επανάληψης).
1. Αύξησε το 3ο στοιχείο της λίστας κατά 30% .
2. Μείωσε το τελευταίο στοιχείο της λίστας κατά το ήμισυ.
3. Τριπλασίασε το πρώτο στοιχείο της λίστας.
4. Εκχώρησε στη μεταβλητή found την τιμή True αν το 6ο στοιχείο της λίστας
είναι θετικός αριθμός αλλιώς την τιμή False.
5. Εκχώρησε στη λογική μεταβλητή found τιμή διαφορετική από αυτή που έχει.
6. Εκχώρησε στη μεταβλητή i το ακέραιο μέρος του 2ου στοιχείου της λίστας.
'''

1. L[2]=L[2]+L[2]*0.3
2. L[9]=L[9]/2.0
3. L[0]=3*L[0]
4. found=L[5]>0
5. found=not found
6. i=int(L[1])



