'''
Ένα υποκατάστημα Super Market έχει δημιουργήσει δύο λίστες για τα προϊόντα που πουλάει. Στη πρώτη
λίστα, με όνομα bcodes, είναι οι γραμμωτοί κωδικοί των προϊόντων (bar codes) σε μορφή
συμβολοσειράς και στη δεύτερη, με όνομα sales, είναι οι αντίστοιχες συνολικές πωλήσεις των προϊόντων
σε ευρώ (€)για το έτος 2019.
Π.χ.
bcodes = [‘5201171000126’,’6901100341234’,…….,’8300112291033’],
sales = [1253,3872,…………..,7812]
Οι δύο λίστες έχουν ακριβώς τις ίδιες θέσεις. Οι αντίστοιχες θέσεις της κάθε λίστας αναφέρονται στο ίδιο
προϊόν.
Ο διευθυντής του υποκαταστήματος ζήτησε από τον προγραμματιστή να δημιουργήσει μια συνάρτηση
σε Python, με παραμέτρους τις δύο λίστες (bcodes,sales), που να αναζητά στην πρώτη λίστα τα ελληνικά
προϊόντα, γνωρίζοντας ότι οι ελληνικοί γραμμωτοί κωδικοί ξεκινούν από ‘520’, και να βάζει τους
ελληνικούς κωδικούς σε μια λίστα grcodes και τις αντίστοιχες πωλήσεις σε μια λίστα grsales. Στη συνέχεια
θα ταξινομεί τις δύο λίστες grcodes και grsales σε φθίνουσα σειρά (από τις μεγαλύτερες προς τις
μικρότερες) σύμφωνα με τις πωλήσεις και θα τις επιστρέφει σε μορφή λίστας με δύο υπολίστες
(grcodes,grsales).
'''


def poliseis(bcodes,sales):
    grcodes=[]
    grsales=[]
    for i in range(len(bcodes)):
        if bcodes[i][:3]=="520":
            grcodes.append(bcodes[i])
            grsales.append(sales[i])
    n=len(grcodes)
    for i in range(n-1):
        for j in range(n-1,i,-1):
            if grsales[j]>grsales[j-1]:
                grsales[j],grsales[j-1]=grsales[j-1],grsales[j]
                grcodes[j],grcodes[j-1]=grcodes[j-1],grcodes[j]
    return [grsales,grcodes]

bcodes=['52073737','5205208875','6205208875','53058875','5204754422']
sales=[520,2058,20,875,12]
result= poliseis(bcodes,sales)
for i in range(len(result)): #for stoixeio in result:
    print result[i]             #print stoixeio

