# -*- coding: cp1253 -*-
'''
Το παιχνίδι «Μάντεψε τον αριθμό» ένας παίκτης παίζει αντίπαλος με τον
υπολογιστή. Ο παίκτης επιλέγει έναν κρυφό ακέραιο αριθμό από το 1 έως το 500
και ο υπολογιστής προσπαθεί να μαντέψει τον κρυφό αριθμό πραγματοποιώντας το
πολύ πέντε προσπάθειες (5 συγκρίσεις). 
Να γράψετε πρόγραμμα που θα υλοποιεί τον αλγόριθμο του παιχνιδιού ως εξής: 
α. Διαβάζει τον κρυφό αριθμό του παίκτη. 
β. Δημιουργεί λίστα Α που περιέχει διαδοχικά τους ακέραιους αριθμούς από
το 1 ως το 500 σε αύξουσα σειρά. 
γ. Εφαρμόζει τη μέθοδο της δυαδικής αναζήτησης για να "μαντέψει" τον κρυφό
αριθμό χρησιμοποιώντας το πολύ πέντε προσπάθειες (5 συγκρίσεις). 
δ. Εμφανίζει το μήνυμα "Νικητής είναι ο υπολογιστής" αν μέσα στις 5
προσπάθειες έχει εντοπιστεί ο κρυφός αριθμός ή διαφορετικά το μήνυμα
"Νικητής είναι ο παίκτης". 
'''
def diadiki(lista,key):
    first=0
    last=len(lista)-1
    found=False
    try=0
    while first<=last and not found and try<5:
        mid=(first+last)/2
        if lista[mid]==key:
            found=True
        elif lista[mid]<key:
            first=mid+1
        else:
            last=mid-1
        try=try+1
    return found

krifos=int(input("Dose arithmos eos 500:"))
A=range(1,501)
if search(A,krifos):
    print "Nikitis o H/Y"
else:
    print "Nikitis o paiktis"




