'''
Να γραφεί συνάρτηση που θα δέχεται ως παράμετρο εισόδου ένα μήνυμα για εμφάνιση στην
οθόνη που θα αποτελεί ερώτηση προς τον χρήστη (με απάντηση ’ΝΑΙ’ ή ‘ΟΧΙ’), θα διαβάζει την
απάντηση του χρήστη πραγματοποιώντας έλεγχο ορθής καταχώρησης και θα επιστρέφει την τιμή
ΑΛΗΘΗΣ αν η απάντηση είναι ‘ΝΑΙ’ ή την τιμή ΨΕΥΔΗΣ στην αντίθετη περίπτωση.
Η συνάρτηση θα χρησιμοποιηθεί σε πρόγραμμα το οποίο:
α. θα διαβάζει, για άγνωστο αριθμό φορολογούμενων, το ΑΦΜ και το ακαθάριστο εισόδημά
τους.
β. θα υπολογίζει και θα εμφανίζει το ποσό φόρου που πρέπει να πληρώσει ο κάθε
φορολογούμενος, αν ο φορολογικός συντελεστής είναι 9.8% για τα εισοδήματα κάτω από
20000€ και 13.4% για όλα τα υπόλοιπα.
γ. θα εμφανίζει το σύνολο των εσόδων που θα λάβει η κυβέρνηση ύστερα από την καταβολή
του φόρου.
δ. θα εμφανίζει το ΑΦΜ του φορολογούμενου με το μικρότερο ποσό φόρου.
ε. θα χρησιμοποιεί τη συνάρτηση που δημιουργήθηκε νωρίτερα για να ελέγξει αν θα συνεχιστεί
η καταχώριση για τον επόμενο φορολογούμενο.
'''

def question(minima):
    print minima
    apantisi=raw_input("Απάντηση:")
    while not(apantisi=="NAI" or apantisi=="OXI"):
        apantisi=raw_input("Δεχόμαστε μόνο ΝΑΙ/ΟΧΙ. Απάντηση:")
    if apantisi=="NAI":
        return True
    else:
        return False
    
min=10000000000000000000000000000000
min_afm=0
sinolo_foron=0
minima="Θέλετε να καταχωρηθείτε?"
while question(minima) == True:
    afm=int(input("Δώσε ΑΦΜ:"))
    eis=float(input("Δώσε εισόδημα:"))
    if eis<20000:
        foros=0.098*eis
    else:
        foros=0.134*eis
    print foros
    sinolo_foron=sinolo_foron+foros
    if foros<min:
        min=foros
        min_afm=afm
print sinolo_foron
if min_afm!= 0:
    print min_afm
    
    
