# -*- coding: cp1253 -*-
'''
Δύο φίλοι αποφάσισαν να παίξουν ένα παιχνίδι με ζάρι. Ο καθένας από αυτούς
μαντεύει τι ζαριά θα ρίξει. Αν μαντέψει σωστά, κερδίζει 1 βαθμό. Το παιχνίδι
τερματίζει όταν ολοκληρωθούν 30 γύροι ή όταν κάποιος από τους δύο παίκτες
συγκεντρώσει 19 βαθμούς. Σε κάθε γύρο του παιχνιδιού παίζουν και οι δύο παίκτες.
Να αναπτύξετε πρόγραμμα που θα υλοποιεί τα παραπάνω και θα εμφανίζει το
όνομα του νικητή, που είναι αυτός με τους περισσότερους βαθμούς στο τέλος του
παιχνιδιού. 
Για τις ανάγκες του προγράμματος να αναπτύξετε συνάρτηση η οποία:
α. θα δέχεται ως παράμετρο τους βαθμούς ενός παίκτη,
β. θα διαβάζει τι πιστεύει ο παίκτης ότι θα ρίξει στο ζάρι,
γ. θα δέχεται τη ρίψη του παίκτη (έναν τυχαίο ακέραιο αριθμό με τιμή
στο διάστημα [1, 6]) χρησιμοποιώντας τη βιβλιοθήκη random(),
δ. θα ελέγχει αν ο παίκτης μάντεψε σωστά και αναλόγως θα τροποποιεί τη
βαθμολογία, την οποία θα επιστρέφει στο κύριο πρόγραμμα.
'''

def zari(vathmoi):
    import random
    riksia=int(input("Provlepsi zariou:"))
    x=random.randint(1,6)
    if x==riksia:
        vathmoi=vathmoi+1
    return vathmoi

giroi=1
v1=0
v2=0
while giroi<=30 and v1!=19 and v2!=19:
    print "Paiktis 1"
    v1=zari(v1)
    #print "Bathmoi:",v1
    print "Paiktis 2"
    v2=zari(v2)
    #print "Bathmoi:",v2
    giroi=giroi+1
if v1>v2:
    print "Kerdise o paiktis 1!"
elif v2>v1:
    print "Kerdise o paiktis 2!"
else:
    print "Isopalia"
