# -*- coding: utf-8 -*-
'''
i =  (1) 
while i ≤ (2) :  
    if  (3) != (4):  
        print i  
    i = i + (5)

Να γράψετε τους αριθμούς 1 έως 5, που  αντιστοιχούν στα κενά του παραπάνω
αποσπάσματος, και  δίπλα σε  κάθε  αριθμό τι πρέπει να συμπληρωθεί, ώστε με
την εκτέλεσή του να εμφανίζονται οι τιμές: 
4, 8, 16, 20, 28, 32, 40 
'''
#Πρέπει:
#4, 8, 16, 20, 28, 32, 40

#Θα έπρεπε:
#4 8 12 16 20 24 28 32 36 40

#Διαφορά:
#12 24 36  --> Πολλαπλάσια του 12


i =  4 
while i ≤ 40 :  
    if  i%12  != 0:  
        print i  
    i = i + 4
