# -*- coding: cp1253 -*-
'''
Έστω λίστα Χ  6 ακέραιων στοιχείων με τις τιμές που φαίνονται παρακάτω:

και το παρακάτω τμήμα κώδικα:
'''
Χ = [ 5, 4, 3, 2, 1, 0 ]
i = 0
while  i < X[i]:  
    X[Χ[i]] = X[i]
    i = i + 1
    print i, X[i], X[X[i]]    
'''
1. Πόσες φορές θα εκτελεστούν οι εντολές μέσα στην επανάληψη;			 	    (Μονάδες 1)
2. Τι θα εμφανίσει το παραπάνω τμήμα αλγορίθμου σε κάθε επανάληψη; 			    (Μονάδες 3)
3. Ποιες θα είναι οι τιμές των στοιχείων της λίστας μετά το τέλος
της επανάληψης;		    
'''
X[i]  i  print
5     0  1,4,1
4     1  2,3,2
3     2  3,3,3
3     3  

Χ = [ 5, 4, 3, 3, 4, 5 ]
