'''
 Σε ένα ΕΠΑΛ οι 20 μαθητές έγραψαν διαγώνισμα στο μάθημα του Προγραμματισμού και  ο
καθηγητής τους το διόρθωσε με άριστα το 100. Να γράψετε πρόγραμμα σε Python το οποίο:
α) να διαβάζει για κάθε μαθητή το επώνυμο, το όνομά του και το βαθμό που έγραψε.
β) να κάνει έλεγχο ορθότητας στο βαθμό ώστε να είναι από 0 μέχρι και 100
γ) να καταχωρίζει το επώνυμο σε μία λίστα EP , το όνομα σε μία λίστα ΟΝ και το βαθμό σε
μία λίστα ΒΑ
δ) να υπολογίζει και να εμφανίζει το ΜΟ όλου του τμήματος
ε) να εμφανίζει τα ονοματεπώνυμα των μαθητών που πήραν πάνω από το ΜΟ της τάξης.
στ) να υπολογίζει τον μεγαλύτερο βαθμό της τάξης
ζ) να εμφανίζει τα ονοματεπώνυμα των μαθητών που πήραν αυτό το βαθμό.
'''
EP=[]
ON=[]
BA=[]
sum=0
#Είσοδος Δεδομένων
for i in range(20):
    epon=raw_input('Δώσε επώνυμο')#Δίνω επώνυμο, ονομα, βαθμό
    onoma=raw_input('Δώσε όνομα')

    vathmos=int(input('Δώσε βαθμό'))
    while not(vathmos>=0 and vathmos<=100):#Έλεγχος ορθότητας
        vathmos=int(input('Δώσε βαθμό'))      

#Επεξεργασία
#Τοποθετώ σε αντίστοιχες λίστες
    EP.append(epon)
    ON.append(onoma)
    BA.append(vathmos)
#Υπολογίζω ΜΟ (χρειάζομαι άθροισμα των βαθμών και πλήθος)
for i in range(20):
    sum=sum+BA[i]
MO=float(sum)/20 #Η διαίρεση ακεραίων δίνει ακέραιο αποτέλεσμα!!!!
print MO #Εμφανίζω ΜΟ
max=BA[0]
for i in range(20):
    if BA[i]>MO:#Βρίσκω/ελέγχω ποιος βαθμός είναι πάνω απο ΜΟ
        print EP[i],ON[i]#Εμφανίζω τα ονόματα των μαθητών 
    if BA[i]>max:
        max=BA[i] #Βρίσκω max βαθμό
for i in range(20):
    if BA[i]==max:
        print EP[i],ON[i]#Εμφανίζω τα ονόματα των μαθητών        
