# -*- coding: cp1253 -*-
''' Να γραφεί πρόγραμμα το οποίο:
α. Διαβάζει αριθμούς μέχρι να δοθεί ο
αριθμός 0 και τους καταχωρίζει στη λίστα AR.
β. Καλεί συνάρτηση η οποία δέχεται την παραπάνω λίστα
και επιστρέφει την τιμή True, αν η λίστα είναι ταξινομημένη κατά αύξουσα σειρά,
ή την τιμή False αν δεν είναι ταξινομημένη.
γ. Εμφανίζει το μήνυμα «Ταξινομημένη λίστα» ή το μήνυμα
«Μη Ταξινομημένη λίστα» αντίστοιχα, ανάλογα με την επιστρεφόμενη τιμή της
συνάρτησης.
'''
def checksort(L):
    n=len(L)
    flag=True
    for j in range(1,n):
        if L[j]<L[j-1]:
            flag=False
    return flag

ar=[]
num=int(input("Dose arithmo:"))
while num != 0:
    ar.append(num)
    num=int(input("Dose arithmo:"))
if checksort(ar)==True:
    print "Ταξινομημένη λίστα"
else:
    print "Μη Ταξινομημένη λίστα"
