# -*- coding: cp1253 -*-
'''
Ταξινόμηση Φυσαλίδας
--------------------
'''
def bubblesort(L):
    n=len(L)
    for i in range(n-1): #Για όλα τα στοιχεία της λίστας.
        for j in range(n-1,i,-1): #Για κάθε στοιχείο από το τέλος μέχρι το τελευταίο ταξινομημένο 
            if L[j]<L[j-1]: #Αν υπάρχει μικρότερο στοιχείο
                L[j],L[j-1]=L[j-1],L[j] #Αντιμετάθεσε
                
'''
Εξυπνη Φυσαλίδα
---------------
'''
def smartbubble(L):
    n=len(L)
    isSorted=False
    i=0
    while i<n and isSorted==False: #Μέχρι η λίστα να τελειώσει και όσο δεν είναι ταξινομημένη
        isSorted=True  #Θεωρώ τη λίστα ταξινομημένη
        for j in range(n-1,i,-1): #Για κάθε στοιχείο από το τέλος μέχρι το τελευταίο ταξινομημένο 
            if L[j]<L[j-1]: #Αν υπάρχει μικρότερο στοιχείο
                L[j],L[j-1]=L[j-1],L[j] #Αντιμετάθεσε
                isSorted=False  #Όρισε τη λίστα ως μη ταξινομημένη
        i=i+1  #Κάνε ενα ακόμη πέρασμα τη λίστα

#Το isSorted==False εναλλακτικά μπορεί να γραφεί not isSorted

