# -*- coding: utf-8 -*-
'''
Ένας πελάτης αγοράζει προϊόντα από ένα κατάστημα. Να γράψετε πρόγραμμα το οποίο:
Γ1.  Για κάθε προϊόν που αγοράζει ο πελάτης, να διαβάζει τον κωδικό του,
τον αριθμό τεμαχίων που αγοράστηκαν και την τιμή τεμαχίου.
Η διαδικασία ανάγνωσης να σταματά, όταν δοθεί ως κωδικός ο αριθμός 0. 

Γ2.  Αν ο λογαριασμός δεν υπερβαίνει τα 500 ευρώ, να εμφανίζει το μήνυμα
«ΠΛΗΡΩΜΗ ΜΕΤΡΗΤΟΙΣ». Διαφορετικά, να υπολογίζει και να εμφανίζει το πλήθος
των απαιτούμενων για την εξόφληση δόσεων, όταν η εξόφληση γίνεται με άτοκες
μηνιαίες δόσεις, ως εξής: Τον πρώτο μήνα η δόση θα είναι 20 ευρώ και κάθε
επόμενο μήνα θα αυξάνεται κατά 5 ευρώ, μέχρι να εξοφληθεί το συνολικό ποσό. 

Γ3. Να υπολογίζει και να εμφανίζει τον συνολικό αριθμό των τεμαχίων με τιμή
τεμαχίου μεγαλύτερη των 10 ευρώ.

Γ4. Να υπολογίζει και να εμφανίζει τον συνολικό αριθμό των τεμαχίων με τη
μέγιστη τιμή τεμαχίου.
'''
sum=0
plithos_10=0
max=0
plithos_max=0
code=int(input("Dose kodiko:"))
while code != 0:
    tem=int(input("Dose arithmo temaxion:"))
    timi=float(input("Dose timi temaxiou:"))
    tel_timi=timi*tem
    sum=sum+tel_timi
    if timi>10:
        plithos_10=plithos_10+tem
    if timi>max:
        max=timi
        plithos_max=tem
    code=int(input("Dose kodiko:"))
print plithos_10,plithos_max
dosi=1
poso=20
if sum<500:
    print "Pliromi Metroitis"
else:
    log=sum-poso
    while log>0:
        dosi=dosi+1
        poso=poso+5
        log=log-poso
print dosi







