# -*- coding: cp1253 -*-
'''
Βιβλιοπωλείο έχει καταχωρήσει σε χειρόγραφο πίνακα με την ονομασία
ΤΙΤΛΟΣ, τους τίτλους καθενός από τα 1500 διαφορετικά βιβλία που διαθέτει
και σε και σε σε ένα άλλο πίνακα, ΑΝΤIΤΥΠΑ τον αριθμό αντιτύπων από το
καθε ένα βιβλίο. Για τα βιβλία εκείνα που δεν υπάρχουν αντίτυπα έχει
καταχωριστεί ο αριθμός 0. Η λειτουργία του βιβλιοπωλείου είναι η
ακόλουθη: Οταν ένας πελάτης επιθυμεί να αγοράσει ένα από τα βιβλία,
τότε, αν υπάρχουν διαθέσιμα αντίτυπα μειώνεται ο αριθμός τους κατά 1,
ενώ αν δεν υπάρχουν διαθέσιμα αντίτυπα τότε ενημερώνει ότι "Υπάρχει έλλειψη".
Να γραφεί πρόγραμμα για τη μηχανογράφηση του βιβλιοπωλείου το οποίο:
Α. Για κάθε ενα βιβλίο που διαθέτει διαβάζει τον τίτλο και τον
αριθμό αντιτύπων και τα καταχωρίζει στις λίστες TITL και ANT αντίστοιχα.
Β. Ταξινομεί αλφαβητικά τους τίτλους των βιβλίων.
Γ. Διαβάζει τον τίτλο ενός βιβλίου που επιθυμεί να αγοράσει ένας πελάτης και:
    1. Αν υπάρχει τέτοιος τίτλος βιβλίων τότε:
        - ελέγχει αν υπάρχουν διαθέσιμα αντίτυπα οπότε μειώνει τον αριθμό τους
        κατά ένα και θα εμφανίζει τον αριθμό αντιτύπων που απομένουν από το
        συγκεκριμένο βιβλίο.
        - αν δεν υπάρχουν διαθέσιμα αντίτυπα, τότε να εμφανίζει το μήνυμα
        "Υπάρχει έλλειψη".
    2. Αν δεν υπάρχει καταχωρισμένος ο τίτλος βιβλίου τότε θα εμφανίζει
    το μήνυμα: "Δεν υπάρχει αυτός ο τίτλος βιβλίου".
Δ. Εμφανίζει τους τίτλους των βιβλίων που υπάρχει έλλειψη.
'''
def bublesort(ar,ar2):
    n=len(ar)
    for i in range(n-1):
        for j in range(n-1,i,-1):
            if ar[j]<ar[j-1]:    
                ar[j],ar[j-1]=ar[j-1],ar[j]
                ar2[j],ar2[j-1]=ar2[j-1],ar2[j]

def search(L,key):
    first=0
    last=len(L)-1
    pos=-1     #found=False
    while first<last and pos==-1: #found==False
        mid=(first+last)/2
        if key==L[mid]:
            pos=mid    #found=True
        elif key>L[mid]:
            first=mid+1
        else:
            last=mid-1
    return pos    #return found
    
TITL=[]
ANT=[]
for i in range(1500):
    t=raw_input("Dose titlo vivliou:")
    TITL.append(t)
    an=int(input("Dose arithmo antitipon:"))
    ANT.append(an)

bublesort(TITL,ANT)

vivlio=raw_input("Doste titlo vivliou pou sas endiaferei:")
pos=search(TITL,vivlio)
if pos==-1:
    print "Δεν υπάρχει αυτός ο τίτλος βιβλίου"
else:
    if ANT[pos]==0:
        print "Υπάρχει έλλειψη"
    else:
        ANT[pos]=ANT[pos]-1
        print ANT[pos]

for i in range(1500):
    if ANT[i]==0:
        print TITL[i]





    
