# -*- coding: utf-8 -*-

print '''Να αναπτυχθεί πρόγραμμα σε Python το οποίο θα διαβάζει το όνομα και τους βαθμούς ενός μαθητή της Α’ Λυκείου σε όλα τα μαθήματα που πήρε το Α’ Τετράμηνο και θα υπολογίζει και θα εκτυπώνει: 
α) τον μέσο όρο του τετραμήνου (15 μαθήματα). 
β) το πλήθος των μαθημάτων που είχε βαθμό πάνω από 16 
γ) το μεγαλύτερο και τον μικρότερο βαθμό 
δ) το ποσοστό των μαθημάτων που πήρε βαθμό από 18-20.
'''
print ''

# Αθροιστές-Μετρητές 
mo=0 # Αθροιστής βαθμολογιών για να βρω τον μέσο όρο (ερώτημα α)
dekaeksi=0 # Μετρητής για μαθήματα πάνω από 16 (ερώτημα β)
dekaokto=0 # Μετρητής για μαθήματα 18-20 (ερώτημα δ)
max=0 # Θέτω το μέγιστο το 0 (ερώτημα γ)
min=20 # Θέτω το ελάχιστο το 20 (ερώτημα γ)

# Διαβάζει τιμές
onoma=raw_input('Δώσε όνομα μαθητή: ') #Ερώτηση όνομα μαθητή
print ''
for i in range(15): # Το ερώτημα Α λέει 15 μαθήματα. Χρήση του 15 στο range
    vathmos=float(input('Δώσε βαθμό μαθητή (0-20):')) #Ερώτηση τι βαθμό πήρε ο μαθητής
    print ''
    # ακολουθει φίλτρο εισαγωγής ΕΓΚΥΡΩΝ ΔΕΔΟΜΕΝΩΝ (0-20)
    while vathmos>=21: # Αν δώσει πάνω από 20 ξανακάνει την ερώτηση
       vathmos=float(input('Δώσε σωστή βαθμολογία μαθητή (0-20):'))
       print ''
    mo=mo+vathmos # Αθροίζει τις βαθμολογίες
    if vathmos>=16:
        dekaeksi=dekaeksi+1 # Ερώτημα β
   
    if vathmos>max:
        max=vathmos # Ερώτημα γ

    if vathmos<min:
        min=vathmos # Ερώτημα γ

    if vathmos>=18:
        dekaokto=dekaokto+1 # Ερώτημα δ


# Υπολογισμοί


# Εμφανιση αποτελεσματων
print 'Έχουμε υπολογίσει κάποια στατιστικά για τον/την ',onoma
print ''
print 'Ο μέσος όρος του Α τετραμήνου είναι:',round(mo/15,2) # Ερώτημα α
print ''
print 'Το πλήθος των μαθημάτων πάνω από βαθμό 16 ήταν:',dekaeksi # Ερώτημα β
print ''
print 'Ο μεγαλύτερος βαθμός είναι ',max,' ενώ ο μικρότερος είναι ο ',min # Ερώτημα γ
print ''
print 'Το ποσοστό των μαθημάτων από 18-20 ήταν:',(dekaeksi*100)/15,'%' # Ερώτημα δ


# Footer
print ''
print 'Εν κουλί αυτό;'
print 'Ευχαριστούμε για την προτίμησή σας.'
print 'E-mail: iefstathios@gmail.com'
print 'Copyleft 2019, Efstathios Iosifidis'
