# -*- coding: utf-8 -*-

print '''Να γραφεί πρόγραμμα που: 
α) θα διαβάζει επαναληπτικά το όνομα και τον βαθμό στον Προγραμματισμό των μαθητών μιας τάξης μέχρι να διαβάσει το κενό ως όνομα μαθητή. 
β) θα υπολογίζει και εκτυπώνει τον μέσο όρο του τμήματος 
γ) Το όνομα του μαθητή με τον μεγαλύτερο βαθμό (υπάρχει μόνο ένας) 
δ) Το ποσοστό των μαθητών που πήραν βαθμό κάτω από 10 
Παρατήρηση. Η διαδικασία επαναλαμβάνεται μέχρι να διαβαστεί ως όνομα το κενό.
'''
print ''

# Αθροιστές-Μετρητές 
mo=0 # Αθροιστής βαθμολογιών για να βρω τον μέσο όρο (ερώτημα β)
mathites=0 # Μετρητής για μαθήματα πάνω από 16 (ερώτημα β)
max=0 # Θέτω το μέγιστο το 0 (ερώτημα γ)
deka=0 # Μετρητής των κάτω απο 10 (ερώτημα δ)

# Διαβάζει τιμές
onoma=raw_input('Δώσε όνομα μαθητή (κενό για έξοδο): ') #Ερώτηση όνομα μαθητή
print ''
while onoma!=' ': # Αν το όνομα είναι διαφορετικό το κενού, θα εκτελεστεί ο βρόγχος
    vathmos=float(input('Δώσε βαθμό μαθητή (0-20): ')) #Ερώτηση τι βαθμό πήρε ο μαθητής
    print ''
    while vathmos>=21:
        vathmos=float(input('Δώσε βαθμό μαθητή μεταξύ 0-20: ')) #Έλεγχος να είναι κάτω από 20
        print ''
    mo=mo+vathmos # Αθροίζει τις βαθμολογίες
    mathites=mathites+1
    if vathmos>max:
        max=vathmos # Αν ο βαθμός είναι μεγαλύτερος του max τότε ο max ισούται με το βαθμό
        maxname=onoma # Ερώτημα γ (θέτω στην μεταβλητή maxname το τρέχον όνομα)

    if vathmos<=10:
        deka=deka+1 # Ερώτημα δ (μετράω τους μαθητές που πήραν κάτω από 10)

    onoma=raw_input('Δώσε όνομα μαθητή (κενό για έξοδο): ') #Ερώτηση όνομα μαθητή
    print ''

# Υπολογισμοί

print 'ΕΜΦΑΝΙΣΗ ΑΠΟΤΕΛΕΣΜΑΤΩΝ'
print ''
# Εμφανιση αποτελεσματων
if mo!=0:
    print 'Ο μέσος όρος του τμήματος είναι: ',round(mo/mathites,2) # Ερώτημα β
    print ''
    print 'Το όνομα του μαθητή με το μεγαλύτερο βαθμό είναι: ',maxname # Ερώτημα γ
    print ''
    print 'Το ποσοστό των μαθημάτων με βαθμό κάτω από 10 ήταν: ',(deka*100)/mathites,'%' # Ερώτημα δ
else:
    print 'Δεν έδωσες δεδομένα να παίξουμε μπάλα...'

# Footer
print ''
print 'Εν κουλί αυτό;'
print 'Ευχαριστούμε για την προτίμησή σας.'
print 'E-mail: iefstathios@gmail.com'
print 'Copyleft 2019, Efstathios Iosifidis'
