# -*- coding: utf-8 -*-

print '''Να γράψετε συνάρτηση SYN που να δέχεται έναν αριθμό και να επιστρέφει το διπλάσιό του , αν είναι μικρότερος του 10, διαφορετικά να επιστρέφει το τριπλάσιό του.
'''
print ''

# Συνάρτηση
def SYN():
    x=input('Δώσε ένα αριθμό: ')
    if x<=10:
        print ''
        print 'Έδωσες αριθμό κάτω από δέκα, οπότε θα σου δώσω το διπλάσιο του αριθμού:', x*2
    else:
        print ''
        print 'Έδωσες αριθμό πάνω από δέκα, οπότε θα σου δώσω το τριπλάσιο του αριθμού:', x*3

# Διαβάζει τιμές
SYN()


# Υπολογισμοί

# Εμφανιση αποτελεσματων


# Footer
print ''
print 'Εν κουλί αυτό;'
print 'Ευχαριστούμε για την προτίμησή σας.'
print 'E-mail: iefstathios@gmail.com'
print 'Copyleft 2019, Efstathios Iosifidis'
